{"text": "I waited forever for a table then even longer for my order. It took over thirty minutes to get my check and it was over priced!  I waited so long for my check I actually thought about just leaving!  It was the worst  experience I've ever had I will never go back!  I miss native new yorker!", "actual label": 0, "predict label": 0}
{"text": "I would not recommend this place. You never know what you'll get at this restaurant. The service is okay but they always seem irritated and pushy. I'm not sure if management understands this or cares. In my opinion I wouldn't choose this place for a party or reservation because you'll get less than what you pay for.", "actual label": 0, "predict label": 1}
{"text": "I stopped by for an egg sandwich on a Wednesday morning. My server was unfriendly and gave off negative energy from the beginning. I waited, waited and waited for my sandwich to come out. I finally asked him how much longer (about 30 mins) and he was rude again, saying.....\"ummm I couldn't tell ya.. sorrrrry. He said it with no compassion and concern. I simply walked out the door telling another server... It shouldn't take over 30 minutes for one egg sandwich on a SLOW day. But honestly, It was this  mans tone and rudeness that will never  bring me back. It's too bad. \nWay to many other places to eat that treat you with respect.", "actual label": 0, "predict label": 0}
{"text": "This is probably one of my worst restaurant experiences. I ordered the food at 8.50 PM for home delivery and they never turned up even after 10.00 PM. When I oridred, they told me that they would deliver the food in 45 mins to 1 hour. When i tried calling them at 10, they were closed. Never ever order food here. The worst thing I had paid for the food but never got it.", "actual label": 0, "predict label": 0}
{"text": "I love this bar. It's cozy and because it's small it is an awesome place to meet other people in the neighborhood. A great place to go when you just want to feel \"home\".", "actual label": 0, "predict label": 1}
{"text": "I stopped into this location for a quick lunch today.  Restaurant was pretty busy.    Upon arriving at 12:35 Pm the tables that were not taken with people sitting at them had dirty dishes on them.  After I ordered and went to sit down I asked the cashier if she could wipe the table, she didn't come over so I just put the dirty dish from the table on the counter next to the register.  I had a salad bar salad and piece of pizza.  By the time I was finished lunch at 12:55 NONE of the tables had been bussed or cleaned and my plate was still sitting by the register untouched.  I was very disappointed in the atmosphere not being clean and only can think about if your dining area is that dirty how dirty is your kitchen?", "actual label": 0, "predict label": 0}
{"text": "The very best service this time due to Rachel who provided superior customer service and attention like I have never seen before from Panda Express.\n\nShe made the experience at Panda excellent", "actual label": 0, "predict label": 0}
{"text": "My hair has transformed since seeing Kat. It's healthier, longer and fuller. She takes her time and gives clients undivided attention to ensure she is meeting your needs. Very happy!", "actual label": 0, "predict label": 1}
{"text": "My husband & I made reservations for two for an anniversary. When we got to the restaurant they told us the restaurant was sold out to a Xmas party and proceeded to walk us out to their pizza place. They put us at a table in the middle of the doorway. I could not get into my seat it was so tight. I tried to pull the table out . That put my husband way in the middle of the doorway. They did have an open table for 4 but would not make it available to us. We just left the place. Ruined our evening!!!!!!", "actual label": 0, "predict label": 1}
{"text": "Went and sat at two open seats at the bar. One of the managers came over after we ordered a drink and said \"can't you obviously see these seats are taken\". Very rude. We moved to a different seat at the bar. The bartenders apologized profusely and bought us a round of drinks. No one ended up sitting at these \"reserved seats at the bar\" so the bartenders moved us back. The bar staff was phenomenal. Manager was a complete tool. Let me know when you let him go and we'll be back for drinks.", "actual label": 0, "predict label": 0}
{"text": "Almost a 40 minute wait for one pad Thai and nothing else. The staff didn't seem to care and just said \"we have new kitchen staff\". Will not be back.", "actual label": 0, "predict label": 0}
{"text": "We had to relocate my young granddaughter's family birthday party at the last minute late this afternoon.  We had a total of 19 people that Red Robin at The Happy Valley location had to accommodate at the last minute.  Every one was so nice and Jared and Ray our servers could not have been more pleasant or helpful.  They even sorted out separate bills for each group in our family. We will definitely be returning there for more family functions!!!!!!!\nThanks again\nVicki S.", "actual label": 0, "predict label": 0}
{"text": "HORRIBLE dining experience tonigt!! Service was terrible, slow and unfriendly. Customers who came in after us by at least 30 min were served food before we were ( both of us ordered pizza ).  Dirty tables not bussed until customers came in and needed to be seated. Heard a customer be told there were no more clean plates... Finally after an hour and a half our bruschetta came out, but the crust was burnt terribly and they tried to cover it up with extra tomatoes. When asked if our pizza was coming soon, was told it had not been started yet!!! Told the server to cancel it and she brought us a check for our drinks!!! Paid cash for our drinks, which should have been comped in my opinion, the server told me they had no change!!  She then had to get me change from her purse. Watched 2 other tables walk out after us! Will NEVER go back!!", "actual label": 0, "predict label": 1}
{"text": "I used to frequent this place when it was in Scottsdale.  I loved this place! So on mothers day I decided to try out the new location via carryout. I called twice and got hung up on twice. I called back a third time to raise a complaint with the manager about the host Danielle ( who clearly doesn't want to do her job). The manager stuck up for Danielle saying that she was a sweet girl and that she would never do that. In the process pretty much telling me he doesn't care about our business. He could not have cared less and took no ownership. It'll be a while if ever I go back here.", "actual label": 0, "predict label": 0}
{"text": "Clothes code for a BBQ place?! Puh-leeze! BBQ isn't considered as gourmet cuisine. It's a fucking barbecue place! Owners are pathetic.", "actual label": 0, "predict label": 1}
{"text": "We went to Farm and Craft last night for my birthday dinner, and it was the worst service we have ever had, from start to finish. The hostess ignored us, and we waited 8 minutes to be greeted by our server when we were sat. I ordered a beer, it took 10 minutes to get. We waited another 5 minutes to order, and the appetizer took 25 minutes to get, and the entrees came out a minute later. To be fair, the restaurant was very busy. But the service was terrible. We will not be back, which is a shame, because this used to be one of our favorite spots. I'm not sure what's going on with this place, it's gotten worse and worse. Do yourself a favor, and don't go here, unless you sit at the bar, and only come during the day. The dinner service is a train wreck.", "actual label": 0, "predict label": 0}
{"text": "Adam, our server was absolutely fantastic. He was attentive to our dietary needs, and had an outstanding attitude. Thank you, Adam! You're amazing!", "actual label": 0, "predict label": 0}
{"text": "Absolutely incredible service. Holland, my server was absolutely accommodating to my needs, and was very knowledgeable. She definitely went above and beyond what was expected, and exceeded what my idea of what a great guest experience is. I will absolutely be back.", "actual label": 0, "predict label": 1}
{"text": "Service was TERRIBLE!  Told us we had to wait 35 minutes even though we had a reservation!!!  3 of 4 of us were there (ontime) and the 4th person was running late.  The hostess said they wouldn't sit us without the entire party so they cancelled the entire reservation and put us on a waiting list for 35 minutes.  The hostess was rude and didn't even tell the party that was there on time that this would happen.  Unacceptable and unbelievable!  Never has this happened to me at any restaurant ever...", "actual label": 0, "predict label": 1}
{"text": "I spent half my life eating food in New York and needless to say I am extremely picky ... I have never had a better Greek meal in my life ... Oh did I also mention that my mom's maiden name is Staros ... OPA ... They also have live music at noon for lunch can you imagine! Tomas may you have a great success in your restaurant fabulous! :-)", "actual label": 0, "predict label": 0}
{"text": "I just moved back here and went to Cavo as part of a bachelorette party and had an AMAZING time!  We did have the luxury of a VIP section which was worth the money! It was so much fun to get dressed up and go out!  Classy place!", "actual label": 0, "predict label": 1}
{"text": "The service here, is sooo bad! We were meeting family, happened to be running behind them and when we got there they were eating already, it took the waiter 20 min just to come take our drink order, another 10 min to come with the drinks and take our order...thought we were good,WRONG! After 45 min. I asked about or food& by the time they came out, approx 5-8 min later, family started leaving, and we just began eating! I will never go there again! They were packed so I could understand a little delay, but come on! 45 min to receive a few of the simplest plates on the menu, um no.", "actual label": 0, "predict label": 0}
{"text": "I've been to this restaurant twice and was disappointed both times. The first time, I drove-through ordered the 4 for 4 meal, and the employee almost sent me home without giving me my drink. Not a big deal, but then when I got home I found that my 4 for 4 meal was a 3 for 4, as there was no burger in my bag. Went back today and again the drive through employee tried sending me of without my drink. When I asked for my sprite, I got an eye roll instead of an apology, and a cup full of carbon water.", "actual label": 0, "predict label": 1}
{"text": "Drove 37 miles on a Saturday at 12:30pm for lunch.... to find the place CLOSED! \nNOT HAPPY !!!!", "actual label": 0, "predict label": 1}
{"text": "This is a decent location, the only complaint I would have is the bar area is not lit very well. All of the bartenders I have been served by were wonderful, I think there is a girl named Sara there?? I'm not sure, I remember she told me it was her first day, this was a couple months ago, she was by far the best bartender I have had at this location!", "actual label": 0, "predict label": 1}
{"text": "The pizza was good and I love the concept of making your own, however this location was filthy and service not so great.  It's a Saturday night and pretty dead compared to other places in the area.  There's 7 employees working and all of them are standing behind the counter not working. What's annoying is that there's not a clean table in the whole place, food all over the floor, etc.  One employee is on his phone texting and one is at the register dancing. What the hell? \n\nIt doesn't look like there's a manager on shift. What's sad is that they have a sign saying they're hiring, yet clearly over staffed with kids that aren't working.  I don't know that we'll go back.  If the place is that poorly run and dirty in the dining area, hate to know what's going on in the kitchen.", "actual label": 0, "predict label": 0}
{"text": "Tried to eat here last night.  Was pretty full.  The hostess sat us in the back room which usually isn't a problem.  We waited almost 7 minutes and i then asked the hostess if we had a server. She said she would find out who it was.  After waiting another 5 minutes no one showed up and the hostess didn't return to let us know she had notified our server. In the mean time the hostess had sat 2 other tables in the back room. I guess business is so good they don't care if people leave. oh, she did thank us on our way out!", "actual label": 0, "predict label": 0}
{"text": "This place had horrible customer service . The manager / owner had me on wait for 10 plus minutes with out even apologizing and was overly rude ... they messed up my last order as well with being 30min late and food was cold....! Places like this need new manager/ better owner-ship because if that was the manager on the phone then contact better Business Bureau ASAP people", "actual label": 0, "predict label": 0}
{"text": "Food was somewhat good lots to choose from but a friend of mine had a problem with her food and asked to have something done about it... the manager on duty wasn't will to give any comps or refunds...liked this as a first time but the service for my friend has pretty much destroyed any chance of us coming back or recommending to others...", "actual label": 0, "predict label": 0}
{"text": "Worst experience ever. I ordered online for delivery. The tracker went through all the phases and stated food was out for delivery, then changed to delivered yet no delivery made. I never received my order. I then attempted to call the store for information, they never answered the phone, I attempted to contact them for 30 mins. with no resolution.", "actual label": 0, "predict label": 1}
{"text": "Ordered food for delivery and all 3 meals were missing items. Both pitas were missing sides and dressing for salad was incorrect. When I called to get corrected they offered to have me drive over to pick it up.  Not  cool when I already paid for delivery. Instead of offering help the owner was just rude and hung up. Never ordering from here again.", "actual label": 0, "predict label": 1}
{"text": "Wow, where to begin?  We just moved to Anthem from Dallas Texas and were looking for a great pizza/Italian place to eat at, but this is NOT the place.  We entered and there were only two other  dinners in the place, one was a family of 5 and the other was a family of 3, we were a party of 2.  We were seated and told that are waitress would be with us in just a minute.  Well, that minute turned out to be about 10 minutes.  Having had time to read the menu about a dozen times while we waited, when our waitress finally did show up we were ready to order but she ask us if we wanted to put in a drink order?  Really???  So we did put in an order for 2 glasses of wine and asked for water as well.  About 10 minutes later we received our wine (very small pour indeed) and no water?  As we were waiting for our food order (I'll get to that train wreck in just a minute) we noticed that the other two occupied tables were having issues with their orders and all we could hear was the waitress consistently apologizing, we also watch as the other tables food was delivered, ONE freaken plate at a time, first one child got some breadsticks, then about 4 minutes later the other child got a salad, then about 10 minutes later the father got his order, then they apparently asked for water and it was delivered ONE glass at a time by the same server (not waiter???) then we experienced the same absolutely mind numbing food delivery, with the exception that I had ordered the 10\" pizza (which was pretty good after a 20 minuet wait) but my wife had ordered a chicken pasta dish, which we never received.  The waitress brought the pizza and two plates and started to walk away and I ask where my wife's meal was and she looked stunned, walked away and came back and told us that she had turned in the order but the \"kitchen\" must have misread it, but she would re-enter the order, well that was about 2 glasses of wine each and one very small pizza later, which had already taken about 55 minutes....duh!  So we simply told her to cancel the order and we would just pay for the pizza and wine and be happy to leave.  It was one of the worst dinning experiences we have ever had.  The \"manager\" was there, tending a small bar, at which NO ONE was sitting, but he did manage to go and clean the back door glass while all of his customers were waiting for service.  It was a totally dysfunctional, totally unacceptable experience and I doubt that we will ever return, unless my wife bets me that it couldn't possible be that bad on a second visit and I might be willing to accept that \"sure bet\"!!!  Unfortunately in Anthem the dinning options are very limited and even the Legend Sports Bar (well, sort of a sports bar) is failing as it changes management???  I ordered a pizza there last  week and was told after a 15 minute wait that they had no cheese for the pizza because the whole kitchen/management team just weren't ordering any food?  Wow, what a way to make a transition in business ownership!!! Someone please help these clueless owners/managers!!", "actual label": 0, "predict label": 0}
{"text": "I've been coming to George's for around 3 years since I live close by. However, I will never come back after the horrible customer service today. I ordered a gyro plate over the phone for take out. When I got there to pick up my food I looked and saw that it was a gyro. I asked to make it a plate and was told that I would be charged for a gyro platter in addition to the gyro I had in front of me because I said plate and not platter. I was told, \"we don't have a gyro plate, we have a gyro platter.\" I've ordered dozens of times before and have never had a problem with the nit-picking of plate vs platter. They could have just thrown a scoop of rice in the box next to my gyro and charged me a dollar more and I would have been completely happy. Instead they chose to lose a customer of 3 years.", "actual label": 0, "predict label": 0}
{"text": "Been here many times for breakfast, the place is a zoo, but it is sort of a controlled chaos, but tonight it was just a write off. I don't know if they were short staffed, but a quick coffee, turned into 20 minutes, then we were told to go stand in line again (10 deep) at 7pm?!?  Extremely slow service, so if you want a quick coffee in the evening go somewhere else, but they seem to have morning coffee figured out!  Of course the parking is the usual :(", "actual label": 0, "predict label": 0}
{"text": "My husband and I decided to try Cibo as it was part of a \"discount card\" fundraiser we had signed up for & when I looked at their website/menu online, they identified themselves as \"gluten free friendly\" and more than happy to accommodate any allergy/dietary needs and as a GF girl, anytime an Italian place says they have GF pasta, I'm pretty happy! We dined on a Saturday evening, with reservations. \n\nI usually try and keep it pretty positive when it comes to reviewing restaurants but our experience was the complete opposite of positive and I hope some changes can be made their in the future because their food had some great elements & their owner was nice but other than that....ugh. \n\nWhen I mentioned that I am GF and asked if I could get the Chicken Parm but without breadcrumbs (which I would normally not even think to ask for but since they had identified themselves as being willing to accomodate allergies I went ahead and asked), I was told the chef \"is busy and wouldn't want to do that but that he could just put some grilled chicken on top of the pasta but she didn't want to ask him to make it \"parmesan\" style, even though I'm pretty sure that would just consist of putting some sauce and cheese on top. I can understand when things are busy it is hard to accomodate special requests (even simple ones like mine) but as a customer (who is paying $20 + for dinner), I don't think I should have to worry about if my order will stress the chef out. Either don't claim to be GF friendly or get some more kitchen help? In the end, I ended up paying a pretty high price for noodles, marinara sauce & grilled chicken :( \n\nOur waitress only smiled when she was dropping off the check & we only smiled when we could finally leave.", "actual label": 0, "predict label": 0}
{"text": "We waited 30 minutes with no one taking our drink or food order. We left. Very disappointing. There weren't very many people there either. If they're going to make it they need to get their act together.", "actual label": 0, "predict label": 0}
{"text": "Worst service ever and all of our food was either cold or not what we ordered. Waited over a hour for our food as well. Our service was awful as well. Bathrooms were so disgusting and un-kept. I don't think I have one good thing to say about this place.", "actual label": 0, "predict label": 1}
{"text": "I will absolutely NEVER go to iPic again!!!\n\nI had been SO excited to go to this theatre with my boyfriend. I had been telling him for 8 months that we had to go to this theatre because I took the tour, knew about it through work, and just loved the whole idea. My boyfriend is a very \"let's do everything last-minute\" type guy, and so it literally took us that much time to finally get into this theatre for a movie. If you want to go, reserve your spot at least a few days in advance. \n\nAnyway, we finally got in and saw Jack Ryan. The tickets were NOT worth the money to sit in this \"exclusive\" theatre. We decided to make a full date of the experience and also have dinner at the theatre. My boyfriend's food and soda came about 30 minutes before the movie ended (around 9:00pm) and I was not so lucky, my food and water never arrived!!! My boyfriend and I both asked the waiter several times when my food and water would arrive, when we could find him that is, and nothing! I asked the waiter to at least bring me some water (I was super dehydrated already) and...NOTHING!!! Finally, at the end of the movie, we complained to the waiter and he said he would get a manager. Guess what? A manager NEVER CAME!!! As I told my boyfriend that night, the difference in the comfort of the seats versus a Harkins or AMC is not large enough for me to overlook the extreme disappointment of having to wonder where the waiter is at every moment. I do not even know what happened in the movie!!! That is how preoccupied I got with where the waiter was, where the food was, and if I was even going to have water to drink!!! \n\nAll in all, the seats are comfortable, of course, if not the theatre would not bring in any business, but I strongly recommend that you just invest in a recliner for your home instead. It is way less frustrating!", "actual label": 0, "predict label": 1}
{"text": "Slowest service ever. Three people at the cash register and only one person making the actual orders.", "actual label": 0, "predict label": 1}
{"text": "Soooooo good.\n\nThey need to open one at Bell Rd. & Loop 303.  Check it out.", "actual label": 0, "predict label": 0}
{"text": "I recently had another birthday and happily started my evening at Papago.  The best thing about this place is that you can trust they will always have something new and really really fantastic on tap to try out.  You would think that would be a given, with 30 taps available.  But I just get this good feeling that they put a lot of heart, and hours of tasting (rough) into surprising and pleasing their patrons with the choices.\nI've enjoyed every visit I've made to Papago, but those guys made it very special for my special day.\nI haven't had the opportunity to try the food yet. Next time, I promise!", "actual label": 0, "predict label": 0}
{"text": "Went on a weekend morning more than a year ago. It says something that I still remember the details of my visit. They were just unorganized. Possibly overwhelmed. Lady who I think was the owner was just barking orders. Maybe we should have waited for a table outside for a more peaceful dining experience...", "actual label": 0, "predict label": 0}
{"text": "Sadly this place has gone downhill since it changed ownership. The original owners did an amazing job. Now just another corporate owned restaurant, where quality gets lost... So sad. Used to be amazing...", "actual label": 0, "predict label": 1}
{"text": "This place knows its identity and does it right. Just a comfortable Gem in the mess of pretentious Scottsdale clubs. I haven't been in a bit, but I hope the bartender Kiki is still there. So friendly and attentive. Such an intoxicating smile. ;)", "actual label": 0, "predict label": 1}
{"text": "Food was alright, the service was HORRIBLE! Both of our orders came out incorrect after waiting extremely long because they don't write anything down when they take the orders. I asked for greens at the end she confirmed did you say grits? I said no greens please.. still ended up with grits. Boyfriends whole order came out wrong and when they brought him back the right order pretty sure they brought out my grits they took back 5 min before from my wrong order and gave them to him. Waitress came back and just set the plate down and walked off. No sorry about that, does it look right now, do you need anything else.. just straight nothing. Never came by our whole meal to check on us.", "actual label": 0, "predict label": 0}
{"text": "I wish i could tell you all about the food but there was problem. My friend and went there for dinner we were seated quickly unfortunately it was in middle of the empty dinning room so we asked to be moved to the side which we were. Upon sitting down we were told we could only have one of the very small table tops there were two together so the hostess told us the manager said we couldn't use two table tops in the empty restaurant. So we got up and left. With the manager chasing us blaming the hostess for the the ridiculous action. Needles to say we will never return.", "actual label": 0, "predict label": 0}
{"text": "Been here 3x and no beef #45, will stop coming; what's the point if it's always out. Take it off the menu since it's never available. Portions getting smaller, prices going up. And the table that came after us got to order first.", "actual label": 0, "predict label": 0}
{"text": "Drive thru: I guess it's opposite day at the drive thru.  Apparently a 'no, thank you' to 'do you want some ketchup' means 17 (I counted) ackets of ketchup for 1 order of fries. Less a star because I'm not a fan of people being wasteful. I know it's just a little thing, but it irks me.", "actual label": 0, "predict label": 0}
{"text": "4 because there's this one cashier who, each time rang our purchases up (different weeks) always looked like a mix of anger and unhappiness for customers im general.\n\nStore is clean, but I gotta say...having clothes for sale...somehow... I no longer wanna call it 'fancy frys' it now seems more like...'wannabe walmart.' \n\nAlmost down to a 3 thanks to that, BUT the pharmacy staff....AweSOME! Super courteous and helpful, really great empathy toward each customer. Not an easy task but they are shining stars in my book.", "actual label": 0, "predict label": 1}
{"text": "Food taste: 2 \nTime to receive food: 3\nCustomer Service: - 5 (yes, that's a negative)\nCleanliness: 3\nAccuracy of order: 0\n\nLiked that the screen is easier to read. Nice printed menus too. Purchased a Groupon  (4 burgers 4 sides) gave our orders (one burger and side to go) and was charged $26 and change. I'll take credit for signing and paying albeit confused, my mistake. Apparently lady assumed I only purchased a Groupon for (2 burgers and 2 sides). I pointed that out, she (lady 1) needed help and the lady (lady 2) who helped only asked the cash registrar for an explanation, not me. No sorry no nothing. Immediate refund of $21 no questions asked. I asked why it was only $21 not $26 and change, a brief and now obviously fake glance at the screen and I was told registrar was right not me. Lady 2 walks to the back and cancels 2 burgers and 2 sides. I patiently wait cause I understood the kitchen was busy and there was a line. I explained we needed 4 burgers and 4 fries again, no apologies for their own confusion and mistakes. Lady 2 just says the whole order needs to be cancelled and redone, again no apologies, didn't even offer to help further, just stayed in the kitchen. Lady 1 put in an order for the other 2 burgers and 2 fries (one to go) offered me 2 free drinks which I declined.\n\nGuess what came to our table. Yep, 2 burgers and 2 fries (you know, the one pair that was to go). Explained to the server that we ordered 4, again no apologies, checks with the lady 1 at the register and shortly brings our order to us. Fries tasted like fries anywhere else, crispy, plain. Nothing special like before. Burgers were bland, both my husband and son said burgers were 'ok, not really tasty like last time.'\n\nAs we're eating, I notice lady 2 walking and chatting to other patrons. She stop by our table to make amends? Why of course not. She looked at us though, and walked away.\n\nLast week I told my sisters to eat here. Just sent a message on group chat telling them not to waste their time. Few weeks ago told my coworkers to stop by here when they're in the neighborhood, I'll tell them about this visit on Monday.\n\nMy advice to management: Tell staff to read, slow down, listen and understand how important customer service is.\n\nAdvice to Yelpers: Smash Burger or In N Out. Taste hasn't changed, service much better. If in Vegas, Wahlburgers.", "actual label": 0, "predict label": 1}
{"text": "I had a 7:30 reservation on a Monday night.  I did not get seated until 8:15.  At 9:00 no chef had come to cook for us. I had already complained to the manager once and he did nothing. Finally my family had to leave as we had hungry young children.  I am so disappointed and will never go here again.", "actual label": 0, "predict label": 1}
{"text": "Unless you've been here before, let me warn you about the \"unspoken house rules\": \n\n1. Order first (do not try and sit down).\n2. Wait for your food while standing.\n3. Find a seat (if one is available).\n\nUnder no circumstances should you sit down before placing an order. And if the place is full, don't try and sit down without food in your hands, unless you want to be made an example of.\n\nMy wife and I (who frequent restaurants several times a week) have never experienced anyone quite as rude as the woman behind the counter at this place.  We had never been here before and when we walked in, my wife sat down at a table and I went up to place our order.\n\nLittle did I know the house rules (see above) and after the people in front of me ordered, the obnoxious cashier pointed to our table and to another table (of newbies) and said to the person who just placed the order: \"you can either sit there or there\", with the tact of, say, General Patton. She never asked us to get up or explained the \"unwritten rules\" to us.  An \"excuse me, but you need to order first before you sit down\" would have sufficed.\n\nSo, my wife got up and we walked out of this place. The food could very well be good - but with waitstaff like this woman - there are plentty of other places around town with not-so crummy service that I'd prefer to spend my money.", "actual label": 0, "predict label": 1}
{"text": "Wow, walked in on a slow Sunday night. Sat at the bar for 8 minutes, there was nobody sitting near me, was totally ignored by the bartender. Got up and left. They would have easily made $50 from me. Worst service ever! I'll never go back.", "actual label": 0, "predict label": 0}
{"text": "This place was so much fun!  The band was absolutely amazing.  The ONLY reason they didn't get a 5th star, was because I asked the hostess a few days beforehand if there was dancing, and she said \"yes, the band is awesome and they move the tables out so people can dance.\"  The band WAS definitely amazing, but everyone kind of just stood there and my wife wanted to dance on her bday.  Other than that.... awesome!", "actual label": 0, "predict label": 1}
{"text": "nice place.  They had a great guitar player that we listened to while having a drink for my wife's birthday.", "actual label": 0, "predict label": 1}
{"text": "pretty awesome place.  A lot to do and it's good for adults and kids.  My son, wife and I went to hang out with friends and had a blast.  Bowled the best game of my life!  130!! haha", "actual label": 0, "predict label": 1}
{"text": "Pretty cool place.  A little hole in the wall bar.  Had a fun time with friends but we had to move tables because they were about to start trivia night.  Man those guys take that seriously.  It was packed with trivia people!!!", "actual label": 0, "predict label": 0}
{"text": "Great little atmosphere to work or meet with people.  I'm not a big coffee guy, so can't tell u if that's good or not.  But, I enjoyed it and the place just has a great feel to it!", "actual label": 0, "predict label": 0}
{"text": "I feel like part of the in-crowd whenever I dine at Barrio Cafe. This is good and bad: good, because I realize, as hordes of other people do, that this is some of the most innovative Mexican food in town; bad, because tonight I realized the in-crowd often is, in its lust for a good meal, downright rude. One set of patrons muscled its way to the front of the line as the restaurant geared up for its 5 p.m. Saturday opening. I mean, really, just get in line. Then, once we were dining, we noticed another set of patrons coming in the back door and just seating themselves at an empty table. The waitperson, to her credit, remained polite toward them. Sigh, I'm trying a week night next time ...", "actual label": 0, "predict label": 0}
{"text": "I would agree that the food and pastries here are above average, but when I walk into a small, crowded, noisy place and don't know where to go for a simple beverage and no employee seems to notice my perplexity or to care, I come away feeling the place is pretentious, snobby, confusing and out of my league. Which is too bad, because it's right in my neighborhood. I sense that if you're a regular here, then probably you feel welcome and the employees chat you up all time. But not all of us can afford to be regulars here. This is at least the third time that La Grande Orange's uppity ambience has annoyed me, so I don't feel guilty about the poor review.", "actual label": 0, "predict label": 0}
{"text": "Delivered wrong pizza.  When called, the guy on the phone didn't seem to care.\n\nI can order from any of the thousand other delivery places.  Thanks, Stevie's", "actual label": 0, "predict label": 0}
{"text": "Zaytoon is dope! Love havin this in the area now.", "actual label": 0, "predict label": 1}
{"text": "Ive been going here for a while (regularly), but lately I haven't seen the owner and it seems like theyve endlessly been rotating deadbeat employees through there. They're screwing up a ton of orders, and they oftentimes dont know the specials or how to run the register....not to mention theyre unprofessional. This place is going downhill QUICK and it's a shame.", "actual label": 0, "predict label": 1}
{"text": "This was our 4th rainforest cafe we have visited. My son picked it for his 5th birthday dinner, worst rainforest expierence ever! Our waitress was very rude, our order was incorrect twice, and she kept making it worse, by screwing it up more, I didn't realize a plain cheeseburger was so hard! For a $200 bill I didn't realize we would have to beg so much for re-fills and correct food. My son enjoyed it, and at the end of the day that was what was important, however next year I'll talk him into something else!!", "actual label": 0, "predict label": 1}
{"text": "The manager is rude, my order is never correct, it really isn't hard to leave ice out of a drink people, the machine does it for you if you ring it up correct! 2 out of 3 times my kids food is wrong. I now avoid this location!", "actual label": 0, "predict label": 1}
{"text": "Do not order to-go from this place. I was told it would take 35-45 minutes for delivery, but after an hour I called to check on my order and was given a \"sorry, he just headed out.\" Another half hour later I had to call and cancel my order because I could not wait anymore. I was out on hold 3 times. Poor service and it sounded as if the employees were clueless on what to do. I got no explanation as to why it took so long. Disappointed.", "actual label": 0, "predict label": 1}
{"text": "My absolute favorite spot for ramen, fried appetizers, and even sushi rolls. I love that they offer a little bit of everything because sometimes that's what I want. Its such a clean and neat place with the friendliest servers and chefs. Alan, who is a chef there is personable and knows how to take care of his guests. Every visit is like I'm seeing a friend while enjoying his creations. \n\nMy boyfriend loves the tonkatsu ramen there and I can't get enough of their chicken or pork katsu. So thin and crispy, paired with fluffy white rice is heaven. Try the croquettes for a solid snack or  octopus appetizer if you dare! Go with friends to order a bit of everything and eat family style or go on your lunch break for a quick and heart meal. It's great for all!", "actual label": 0, "predict label": 1}
{"text": "Hands down, best sushi place I've ever been to. Customer service is always a must have with me and this place is all about it! Have had every server (been there that much) and they are all friendly, know the menu, and recommend the best specials! The sushi is amazing, don't be afraid to ask what's good that day because the chefs know what's up!! Atmosphere is never a let down. You find yourself conversing with the boss in no time, which makes you feel really welcome :)", "actual label": 0, "predict label": 0}
{"text": "My favorite little breakfast place with Midwest style down home cooking and great prices! My husband and I visit at least once per week. Service is quick, atmosphere is welcoming and the owners are wonderful!", "actual label": 0, "predict label": 0}
{"text": "I have been looking for a good Chinese restraint for lunch near work. This one fits the bill perfectly.", "actual label": 0, "predict label": 0}
{"text": "Best gift for a foodie - The Chef's Table.", "actual label": 0, "predict label": 1}
{"text": "The guy in purple shirt  asking the black bus boy to go out back and fight what a turn off from this place 3rd time i ate here from out town this loud mouth pushing what  seems  to be a manager  never again will i eat there cause of him and i staying across the  street for 2 months  for work shame  on him the girls were just shaking  there head cause of his behavior  lots of kids with  family present", "actual label": 0, "predict label": 0}
{"text": "This has been the worst experience I have ever received at a business establishment. So much so that I feel obligated in writing my first Yelp review in the five years since I've been a member.. \n\nThis is how the story goes:\n\nMy girlfriend and I arrived on Saturday 8/26 to watch the Mayweather/McGregor fight. Prior to arriving we called ahead to ask for the cover prices. We were told $10 at 4pm then $20 at 5pm and $30 after 6pm. So fast forward to arriving at the entrance BEFORE 5pm and to my surprise we were told we had to pay $20 since it was beginning to get \"unexpectedly\" crowded. So after we agree to reluctantly pay the cover, we were then told by the hostess that we were highly unlikely to get a table/seats. Granted, this was after we had already payed the cover charge to get in fully expecting to at least be able to sit at the bar. As we enter we realize how insanely crowded it is with no open seats in sight. We could not even order drinks at the bar because it was so crowded. After a brief browse around the area we came to the conclusion that it was just too crowded and it wasn't worth it to stand for who knows how long and wait for open tables/seats. By then we're both irritated and decide to leave after a few minutes of searching for open seats and squeezing through the crowd. \n\nAt this point, we arrive back home (no more than 10 minutes from Sandbar). Still irritated by the fact I had spent $40 for feeling totally uncomfortable and for something I didn't even receive (watch the fight), I call Sandbar in hopes of receiving a refund. We speak to a woman and let her know our situation. She tells us that they should be able to refund us, however because it was too busy they wouldn't be able to do it that day and to call and speak to a manager tomorrow. We make sure to let her know that we would be able to drive back and show our receipt if that would make it easier, but she continues to encourage us to call and speak to a manager tomorrow. \n\nSo we call back the next day to speak to a manger, however we are told that the manager who handles refunds was not there and to call back tomorrow. \n\nSo then we call back the following day, and to our surprise the manager who handles refunds was still not there and that he would be in the next day.\n\nIt's now Tuesday, and thankfully the manager we are waiting to speak to, Steve, is finally in. My girlfriend explains the situation and how we've been waiting days to speak to him and get our refund. Initially, Steve offers to give us a $40 gift card, however at this point we just want our money back. Steve tells my girlfriend he will call her back to let her know his verdict. Finally he calls back and VERY RUDELY tells her that he is NOT going to refund our money and even goes as far to take the $40 gift card off the table. He tells her that at this point, if we are going to want a refund, we must call corporate and immediately hangs up the phone. \n\nSo officially pissed off at this point, I call corporate and leave a message with Natalie explaining the situation. She tells me that I should receive a call back tomorrow. And now the waiting game begins.....\n*This review will be updated as soon as I hear back from someone.*\n\nNOTE: This entire situation has been a mess, and if the owners/leaders of this establishment had any sense of integrity towards their patrons, they would make this right!", "actual label": 0, "predict label": 1}
{"text": "The service here sucks.  We waited over 24 mins for food.  Our waitress was oblivious. Once she got our order we didn't see her again.  I finally had to flag someone down.  Then once we got our food she asked how everything was and then she was gone again.  I had to flag her down for boxes and check.  The food here is not worth the horrible service.", "actual label": 0, "predict label": 0}
{"text": "These people know how its done. I have been there a few times now and I can say with good heart and full stomach, its good. Whats even better, is they treat you with respect. Now I know that may not play out to many people, but to me, the vibe you get from the staff, sets the tone, right off that bat, and its a good vibe here. I even take others there, when i want to be nice and have some class ;)", "actual label": 0, "predict label": 0}
{"text": "Great tucked away, hole in the wall, Thai restaurant! Was a bit skeptical based on the location and outside appearance; however, so thankful I tried it anyways! Great Pad Thai & Drunken noodles! Will be back very soon.", "actual label": 0, "predict label": 0}
{"text": "Everything is great I go here at least once a week!  I love the spring rolls and the prices are great", "actual label": 0, "predict label": 0}
{"text": "Boy for a Saturday they sure are slow! 13 people in line and the guy taking the order got the name wrong. ..weirdest spelling of Lena I've ever seen. The 43rd and bell location doesn't seem to have the same problem. Two employees didn't wear hats or hair nets what's with that what about health code?", "actual label": 0, "predict label": 0}
{"text": "I had heard about the new steak house and thought I'd try it. It was packed but I was alone so I thought it might not be that long. I wasn't welcomed and when I asked I was told it would be 45 minutes!  It was extremely loud and there was no where to sit I waited 15 minutes and the noise made me decide to go black Angus where I didn't have to wait and it was a much better atmosphere and after reading comments better food too!", "actual label": 0, "predict label": 0}
{"text": "Had a horrible experience I will never go back in there and will never take my children one of the guys name Jonny pull a toy from  my daughter and snatch it out of her hands the managers and their don't even know what they're doing they overcharge you the pizzas were not even ready they gave me my pizza my food an hour and 40 minutes later because even if they gave it I to   another customer", "actual label": 0, "predict label": 0}
{"text": "Good place for a very nice dinner.  We went for an anniversary and they really impressed us!  Guys, make sure they know it is your anniversary when you make the reservation.", "actual label": 0, "predict label": 0}
{"text": "This is a solid restraunt for a very nice lunch or a good dinner.  Great atmosphere and everything is a little better there.", "actual label": 0, "predict label": 1}
{"text": "Solid lunch spot, a little on the pricey side but classy enough to be ok.", "actual label": 0, "predict label": 0}
{"text": "Love this place!!! I exercise just so I can keep eating here!!! Great people and prices.", "actual label": 0, "predict label": 1}
{"text": "The staff there were rude and chatty. I took my mother, sister, nieces, step son and fiancé there to enjoy for lunch. First is was the glass I was drinking out of had lipstick stains on the rim, so I re-ordered a new clean glass of soda. I wasn't upset or throw a fit about it, but as soon as I turned my back at the counter the girls there instantly started complaining about it. They didn't seem to care that I could hear them, but I didn't bother. But as we got our meal, two orders weren't right the waitress had to re order and resubmit our ticket. So we waited another 30 minutes, by then everyone was done eating. I again let it slide, but when the waitress served us our meal she looked at me and with an attitude she asked \"is there anything I can get for you your highness?\" Instantly I was upset and requested to speak to a manager. When the manager came she instantly said \"what is it now?!\" I replied \"what is your issue with me? We just asked for our meal and the two orders were wrong and I had to reorder a clean glass of soda. I did nothing wrong and I didn't throw a fit.\" Instantly she stated that according to her staff I was being rude and demanding and my staff does not need that kind of attitude from anyone. I told her over and over again that I didn't give any of your staffs members any attitude and nor was I rude. She asked if there was anything else I would like and turned away to go back to the kitchen. So when we got the bill we were charged for the re orders and the clean glass of soda and they automatically added the gratuity to the order. I was so upset I just paid to get out of there and I never felt so humiliated and felt that it was u fair that I paid for the full meal and their mistake and not to mention the attitude from the staff. I been there twice before and never had an issue. Let's just say I'll be avoiding the place and never would refer anyone to eat there. I hope they don't treat any customers like that, that was very disappointing and very unprofessional.", "actual label": 0, "predict label": 1}
{"text": "I've been to the drive through four times and every single time I get the grouchy girl at the first window. I can't tell if she had assburger syndrome or if she just hated her job? Anyway, on the fifth time I went through the drive through and was not in a mood to make dinner because of a long day at work. A \"new girl\" is at the first window and \"placing orders\" but she is just as terrible as the girl she replaced. First off, she was she was rude and lacks common courtesy to tell her customers that her headset was not working very well. So instead, I get the sarcastic and condescending attitude and the sighing over the headset with a demanding tone to repeat my order five times. Finally, after 10 mins of trying to place my order I drive around the corner to give her the money at the window, she opens the window and yells at me, \"yo! My headset is like broken so I had to repeat a lot of things, so yeah!\". \nUm, ok?! How am I suppose to know that you wanna be Snooki?! She then demands \"you owe!\" Then slammed the window as I turn to give her my cash from the coffee holder. THAT WAS THE LAST DRAW! I'm so annoyed and sure as hell don't need the petty drama from an immature, too much eye makeup, bobblehead child! I did not have the patience for her ignorance and not to mention I did not want to lose my appetite as she was proudly displaying her disgusting hickies on her neck! Yuck! That's exactly what I need to see before my meal! Effing gross!!! \nSo instead, I drove up to the second window and gave my money to the young gentleman, whom politely confirmed my order, and provided me with an apology for the other associate. Even though the guy was nice, I don't think I'll be going back to this location. I just feel bad that has to work with girls like that. Hickies are disgusting! They are not to be proudly displayed. *vomit*", "actual label": 0, "predict label": 0}
{"text": "Ate here recently and had a great experience. The 3 employees were extremely polite and hard working. In fact, I was so impressed with the service that I went home and wrote a positive review directly to the company. I'll be back for sure!", "actual label": 0, "predict label": 0}
{"text": "Never takes card after 10pm. Slow and often not the most friendly. The store its self is nice but the service is just so slow", "actual label": 0, "predict label": 1}
{"text": "amazing view city lights menu is always different wich is plus for me i rather have something different every time its definitely and experience to remember staff is wonderful made sure everything was perfect", "actual label": 0, "predict label": 0}
{"text": "My husband and I have been going to Durant's for over 30 years to celebrate special occasion. My young adult kids know we love this place so my daughter and her husband purchased two $50 gift certificates for Christmas.  They gave one to me and one to my husband. We were planning to celebrate our anniversary and my husband could not locate his gift certificate. Mine had a serial number so I called and explained that my husbands gift certificate would be the number right next to mine.  They were signed by a manager and I mentioned her name, I also gave the date of purchase. They said they would look into it but called back and said we can't get credit without the card.  This was the case even though he looked it up and clearly knew my daughters name which is obviously logged into a book.  What makes it worse is the fact that my daughter is in a grad program so has no income this year.  They are on a really tight budget and it makes me really sad to know they had to waste $50.  I take responsibility for my husband misplacing it but I've never had any other lost giftcard not be tracked and replaced.  No more gift cards to this place!! Why have serial number on your gift certificates if you still won't honor them.  It can clearly be tracked and we would have no intentions of using the card and making this up to try to use again.  It was such a disappointment that we just cancelled our reservations.", "actual label": 0, "predict label": 1}
{"text": "We went with another couple for our anniversary.\nWe paid full price, which was definitely NOT worth it.\n Pop/Soda/tea....if it was included in the price...no one was serving it. Just water and coffee at the table.\n\nI paid for 2 cocktails.....just to get through it.\n\nToo long...too much dialogue, not enough acting. Too much work required that really didn't lead you to solve the murder.\n \nIf you are thinking \"Clue\" it is nothing like that.\nWhich was disappointing.\n\nAlso insulting: WAY overpriced photos, they should have been included in the price especially in our world of Selfies.\n\nOverall, we wouldn't recommend it. Too overpriced,\nToo long, too hard to follow. Too much work, not enough \"fun\" and tedious detective work that was not relevant.\n\nThe funnest part was one  of our party was a suspect.\nInside jokes made that our personal highlight.\n\nShould have opted for a comedy club instead.\nFirst and last time for a Murder Mystery dinner. \nIf we could get our money back, we would.", "actual label": 0, "predict label": 0}
{"text": "I have been dining at Il Vinaio for the last year or so and have nothing but great things to say. First off, the service is absolutely terrific! From start to finish, this restaurant has your best interests in mind with their great wine and food reccomendations. I feel confident ordering anything off their menu. I know finding great restaurants in Mesa, AZ is tough but Il Vinaio makes it easy! Go here!", "actual label": 0, "predict label": 0}
{"text": "First time was 6 months ago had bad experience, manager was very sorry for it and invited us back..came back much better experience, bartender Austin was awesome,knew menu, very nice and very attentive to our needs!! Michael manager great as well.will be back again!!! Thanks guys", "actual label": 0, "predict label": 1}
{"text": "good idea to Number to doors 1-8 so u can tell ur friend u will pick em up at door # bla bla, but it was very confusing for first timer from San Francisco. U have to walk, go down, then get on weird subway. But AAAA+++++ for rental car pick up outside doors about 50 feet, NO SHUTTLES TO PICK UP CAR_______YEAH.", "actual label": 0, "predict label": 1}
{"text": "SAN FRANCISCO VISITOR ate here 3 times in one week.", "actual label": 0, "predict label": 0}
{"text": ".....ya know, I should have known better! never settle for less cuz your in a hurry.", "actual label": 0, "predict label": 0}
{"text": "This Taco Bell/KFC is quite possibly the worst fast-food establishment in Glendale. For years I've waited for this place to get their act together, between rude, unhelpful employees who never get an order right (and I do mean NEVER.) to poorly prepared items and everything in between. Half the staff looks as if they are burnt out on pills or heroin which wouldn't surprise me and would explain a whole lot about this place. Last night I decided to try it one more time and see if anything has changed. Well I'm unhappy to report that they did change, they got worse. Not only did they get my order wrong but when we drove back and went inside to bring it to their attention the burnt out soon to be addict looking girl came from the back munching on what I presume to be the nachos they forgot to put in my bag and just replied \"Oh.\" Tossed us our drink and went back and got our missing item. How this hell hole has survived as long as it has is beyond my imagination. Do they use this location to train new employees? Has this location gone rogue? Do they pride themselves on horrible service and a disgusting interior? I'll probably never know, but I just wish this place would close down. Neigh, BURN down, taking whatever malevolent entity that controls this dump with it. \n\nTL;DR: this place is a god damn joke, avoid it like the plague. I'm even having second thoughts about posting this review because then I'd have to rate it at least 1 star. This place is a definite 0/5. They should pay you to eat there.", "actual label": 0, "predict label": 1}
{"text": "We have been loyal customers to Orient for the last 4-5 yrs. Until recently we would've given them 5 stars, they barely deserve one anymore. \nThey used to have 3 servers who knew us by name and also had our regular order memorized. The service and food were perfect. Slowly they have all disappeared and now it seems like the servers are brand new each time. I'm guessing the turn over rate is due to the Manager/Owner lady, who is always so angry and rude, speaks broken english which is impossible to understand and has the worst energy ever. \nWe have recommended this place to lots of friends and family over the years because we loved the food, it was always consistently good. Now it tastes different every single time. The service is horrible. They get every order wrong. They don't refill drinks. They don't bring plates or chopsticks, and worst of all they make you wait the longest for the bill! \nTHAT LADY IS RUINING THAT PLACE!! \nSomeone tell her to check out YELP if you're lucky enough to meet her.", "actual label": 0, "predict label": 1}
{"text": "I have been a regular at this deli because the service is exceptional, the place is clean, and the ladies that run the counter are professional & friendly. I'm a big fan of the smoked bacon and head cheese.  It is definitely european if you know what that is.  Someone who calls these nice ladies snotty must really have issues. That's just my opinion.  Maybe you came on an off day.  What's wrong with paying cash?  Just come prepared.  I do.", "actual label": 0, "predict label": 1}
{"text": "Went back to TopGolf and had a great experience. The staff and management team must have made some adjustments since my last review and I will definitely be back!", "actual label": 0, "predict label": 0}
{"text": "Every time I make an attempt go eat here they are always closed. I'm not even sure if they are still operating as a regular restaurant or just a banquet hall.  Very disappointing place.", "actual label": 0, "predict label": 0}
{"text": "I'm leaving one star because of customer services. My friends and I went here for one there birthday expecting to have a good enjoyable time. We sat down and our waiter didn't even say just straight \"what do you want to drink\" got our drinks. And asked what we wanted to eat my friend order the unlimited pasta and soup. When her soup got there she ate some and then asked me if I wanted to try it so I tried that's it. And she took it back and finished it and asked for another one and he said I have to charge 2.99 for sharing and we then explained that i was just trying and he said \"No I saw her eating it I'm pretty sure she ate most of it\" which wasn't true I tried a little bite of it and didn't even care for it so why would I eat it? and so then we decided we were done and she didn't want more soup. \nHe was very fine with other customers but I'm sure it was because we are teenagers. Which in my opinion in very unacceptable because we still tip but if you want that tip treat us right too. \n\nAll the food was good though.", "actual label": 0, "predict label": 1}
{"text": "This place has real potential but falls short in a few areas for sure.\n\n  The bar staff is somewhat attentive but seems to be more preoccupied with spinning glasses than serving drinks in a timely fashion.  One bartender broke a glass right in front of me while flipping it.  The staff seemed inexperienced and not well trained. I repeatedly watched the bartenders scoop ice out of the ice bins with a pint glass, its just a matter of time before someone ends up with a glass chip in their drink.  \n  The waiter I had took almost ten minutes to greet us. He showed up with no menus or drink lists but expected us to know what we wanted once he finally showed up.  He was pleasant enough but again just not super sharp.\n The look of the place is pretty cool. The patio is sweet and I love the decor for the most part.  I noticed some other \"restaurant rip offs\" like the gum bullseyes that Postino has at their wine bars.  Everyplace doesn't need to be super original but some things are blatant and show no imagination.\n  All in all I was not impressed. This place needs some real direction and fine tuning.", "actual label": 0, "predict label": 0}
{"text": "Stopped by for just a cocktail and to check the place out.  The bartender was rude and short with us.  After three attempts of trying to figure out what she was saying, we got it!  We didn't even get a chance to look at the menu as we couldn't finish our cocktails fast enough.  There was not a very welcoming atmosphere, apparently unless you are a regular, and the \"smoking patio\" is a joke.  Because of the non-welcoming atmosphere, we won't be back.", "actual label": 0, "predict label": 0}
{"text": "We've been here a couple times to see some friends play music.  Great outdoor patio!  We've had good service too.  Employees were very friendly and welcoming.  We will be back.", "actual label": 0, "predict label": 0}
{"text": "We were super excited to find out there was a Beach House opening by us!  The place was clean and the staff was friendly.  We ordered a variety of items and saved the tacos for last.  The food took a long time to come out (they weren't too busy) but you can attribute that to being new as well.  The main issue was I found a piece of chicken bone in my taco.  Hopefully this is all because they are still new.  We will give it a try in a few months to see what has changed.", "actual label": 0, "predict label": 1}
{"text": "This down-to-earth, gritty neighborhood bar/grill should be a destination must-see for Scottsdale.  They will be celebrating their 35th year anniversary in October and there aren't many places that can claim this feat.  Even though I'm not a fan of country music, I must say this place is fun!  The bartenders are spot on and friendly.  The drinks are tasty, but the people watching is the BEST!  The bathroom is a little tiny but workable.  I haven't had a chance to eat there but my friends who have say the food is good.  Check out the bar on Sunday nights (Chris is bartending - awesome bartender!).  The house band is rockin' and it's always busy.  It's a great place to get rid of those Sunday night blues.", "actual label": 0, "predict label": 1}
{"text": "I'm not a fan of corporate restaurants, but we know quite a few people that work at this location so we like to stop by and see them once in a while.  I don't know if all RL's are like this, but they seem to hire the best kids here!  All the staff is hard working and seem to work together to make sure your meal comes out in a timely manner, etc.  Love the grilled fish menu (trying to stay on the healthy side) and they will make modifications to your order without hesitation or grief.  I wish there were more of a selection of sides, (asparagus or something on the healthy side) but that also might just be my taste buds.", "actual label": 0, "predict label": 0}
{"text": "This was our first time here and we were quite impressed!  The atmosphere was unique (high top, nice looking tables in the bar, a bar you could sit at, tables of various sizes throughout, a couple booths and a separate, glassed in room for dining).  People of all styles would feel comfortable here.  The menu is quite large and was overwhelming until our AWESOME waiter explained everything to us.  The food was great and there are quite a few more items on the menu that we would like to try.  What made the entire meal was our server James.  He knew his stuff!  He suggested some wines; some we liked, some we didn't.  The ones we didn't like he took back and suggested another glass.  We never waited on anything and he kept us in the loop about the status of all the different small plates we ordered (there was 6 of us)\n\nThe idea of a mushroom bar is unique in itself.  I like how you can pick one large or 3 smaller mushrooms.  The choice of toppings is incredible!  I gave this restaurant only 4 stars because we were only there once.  Even though we don't live close, we will be back and I would think the # of stars would raise to 5.  Especially if we get James as our server again.", "actual label": 0, "predict label": 1}
{"text": "This restaurant location has been a gazillion different names over the years. I'm not a fan of BBQ but it sure smells good the minute you walk in the door. They have done quite a bit to spruce this place up into a sports bar. There are TVs everywhere (VERY nice TVs), except on the patio. The bartender, Jen, was super nice and friendly and gave us GREAT service. The patio is an odd-shape but they have done wonders decorating it. There is shade and a misting system. The couple regulars sitting at the bar were friendly as well. The place is clean and comfy. They have live music on the weekends as well as the UFC fights and football. The prices were reasonable as well with many items on the menu a non-bbq girl would like.", "actual label": 0, "predict label": 1}
{"text": "Very disappointed in the integrity of a reservation. We made a reservation for a pull through two weeks in advance. We even called 4 hours before arrival to assure a pull through due to the size of our rig. However when we arrived at 6pm we were told our pull through had been given to someone else and we were put in a back in that was too short. The reservation manager was not apologetic and told us that a reservation for a pull through only assured us a \"spot\". She said we were welcome to find someplace else if we weren't happy. Too bad because this is a nice resort with Pickleball courts but if we can't depend on the integrity of a reservation, we won't be back. We have referred people to this resort but never again.", "actual label": 0, "predict label": 1}
{"text": "I love Pita Jungle, but this location's customer service is pretty terrible. Walked in to pick up a to go order, stood at the counter where it is clearly designated as the pick up area, and stood there for more than 5 minutes and received ZERO acknowledgement from the staff. Now, if it were busy then I might understand, but it wasn't. This one experience completely turned me off to this location. I will make the longer drive to the location on Shea. Next time try smiling, saying hi, and provide some acceptable customer service.", "actual label": 0, "predict label": 0}
{"text": "I wish i could tell you all about the food but there was problem. My friend and went there for dinner we were seated quickly unfortunately it was in middle of the empty dinning room so we asked to be moved to the side which we were. Upon sitting down we were told we could only have one of the very small table tops there were two together so the hostess told us the manager said we couldn't use two table tops in the empty restaurant. So we got up and left. With the manager chasing us blaming the hostess for the the ridiculous action. Needles to say we will never return.", "actual label": 0, "predict label": 1}
{"text": "4 because there's this one cashier who, each time rang our purchases up (different weeks) always looked like a mix of anger and unhappiness for customers im general.\n\nStore is clean, but I gotta say...having clothes for sale...somehow... I no longer wanna call it 'fancy frys' it now seems more like...'wannabe walmart.' \n\nAlmost down to a 3 thanks to that, BUT the pharmacy staff....AweSOME! Super courteous and helpful, really great empathy toward each customer. Not an easy task but they are shining stars in my book.", "actual label": 0, "predict label": 1}
{"text": "My last review was a novel, this will be short. Ordered online for pick up, food was handed to me at EXACTLY that time, not a minute later. Aaarrrmmmyyygaaawwwd amazing!\n\nWhy the 3? One order was wrong :( BUT it was pretty good anyway so I'll leave it be. We're all human after all.", "actual label": 0, "predict label": 1}
{"text": "Average food - had the worst service last night from a young man.  We were the only table in the restaurant at 8:15 - our server was rushing us out", "actual label": 0, "predict label": 0}
{"text": "I had a 7:30 reservation on a Monday night.  I did not get seated until 8:15.  At 9:00 no chef had come to cook for us. I had already complained to the manager once and he did nothing. Finally my family had to leave as we had hungry young children.  I am so disappointed and will never go here again.", "actual label": 0, "predict label": 0}
{"text": "Unless you've been here before, let me warn you about the \"unspoken house rules\": \n\n1. Order first (do not try and sit down).\n2. Wait for your food while standing.\n3. Find a seat (if one is available).\n\nUnder no circumstances should you sit down before placing an order. And if the place is full, don't try and sit down without food in your hands, unless you want to be made an example of.\n\nMy wife and I (who frequent restaurants several times a week) have never experienced anyone quite as rude as the woman behind the counter at this place.  We had never been here before and when we walked in, my wife sat down at a table and I went up to place our order.\n\nLittle did I know the house rules (see above) and after the people in front of me ordered, the obnoxious cashier pointed to our table and to another table (of newbies) and said to the person who just placed the order: \"you can either sit there or there\", with the tact of, say, General Patton. She never asked us to get up or explained the \"unwritten rules\" to us.  An \"excuse me, but you need to order first before you sit down\" would have sufficed.\n\nSo, my wife got up and we walked out of this place. The food could very well be good - but with waitstaff like this woman - there are plentty of other places around town with not-so crummy service that I'd prefer to spend my money.", "actual label": 0, "predict label": 1}
{"text": "This place has been sold once sold twice sold sold sold. And the food has going more downhill than Kyle Rasmussen at Incline Village circa 1982..... give it a pass.", "actual label": 0, "predict label": 1}
{"text": "Wow, walked in on a slow Sunday night. Sat at the bar for 8 minutes, there was nobody sitting near me, was totally ignored by the bartender. Got up and left. They would have easily made $50 from me. Worst service ever! I'll never go back.", "actual label": 0, "predict label": 1}
{"text": "This place was so much fun!  The band was absolutely amazing.  The ONLY reason they didn't get a 5th star, was because I asked the hostess a few days beforehand if there was dancing, and she said \"yes, the band is awesome and they move the tables out so people can dance.\"  The band WAS definitely amazing, but everyone kind of just stood there and my wife wanted to dance on her bday.  Other than that.... awesome!", "actual label": 0, "predict label": 0}
{"text": "nice place.  They had a great guitar player that we listened to while having a drink for my wife's birthday.", "actual label": 0, "predict label": 1}
{"text": "pretty awesome place.  A lot to do and it's good for adults and kids.  My son, wife and I went to hang out with friends and had a blast.  Bowled the best game of my life!  130!! haha", "actual label": 0, "predict label": 0}
{"text": "Great place!  Tickets include popcorn, pillow and blanket with waiters.  Wow!", "actual label": 0, "predict label": 1}
{"text": "Pretty cool place.  A little hole in the wall bar.  Had a fun time with friends but we had to move tables because they were about to start trivia night.  Man those guys take that seriously.  It was packed with trivia people!!!", "actual label": 0, "predict label": 1}
{"text": "Great little atmosphere to work or meet with people.  I'm not a big coffee guy, so can't tell u if that's good or not.  But, I enjoyed it and the place just has a great feel to it!", "actual label": 0, "predict label": 0}
{"text": "This theatre is the ultimate splurge!  From the comfy recliners complete with blanket and pillow (in the premium seating) to the fantastic wait staff you couldn't ask for a more luxurious way to watch a movie.  Being able to book online and have reserved seats is very convenient.  Yeah, it's expensive (total of $250 for premium seating and dinner for 5-no alcohol involved) but is worth it for a nice evening out with friends once in awhile!", "actual label": 0, "predict label": 0}
{"text": "Went tonight for a quick dinner which turned out to be over an hour.  Nice decor, very clean but the very slow service (40min wait for our entrees) was way too long.  Never saw the waitress again after we placed the order until it was time for the check.  When the food arrived, it was only lukewarm and despite my attempt to flag down a waiter to refill our drinks, we were basically ignored.  Can't see this place lasting any longer than the other places that have been it this location, will not return.", "actual label": 0, "predict label": 0}
{"text": "Had a very enjoyable time at Vintage95 last Saturday night. The wait staff was top notch and very accommodating. Very comfortable atmosphere and furnishings. The young woman paying guitar was excellent ... wonderful renditions of a Roberta Flack and Cranberries tunes, among others. Looking forward to going back and sampling the single malts they have.\n5 Stars for my date too!", "actual label": 0, "predict label": 1}
{"text": "I came in to get some boba tea and there was a employee eating behind counter that wasn't professional. The cashier seem rude and unhelpful.", "actual label": 0, "predict label": 1}
{"text": "Their specials menu is extremely misleading -- I went there on a Wednesday, and according to the menu you get \"50 cent drafts with any entree.\"  So I ordered an entree and asked what they had on draft.  Apparently that wasn't specific enough, because my beers were $5 a pop.  The waitress played dumb, and when I spoke to a manager he treated me like an idiot for not asking for the \"draft specials\" rather than the drafts.  That language is nowhere on the menu.  He told me if I didn't want to pay that much, \"we were going to have a problem.\"  He didn't even offer any sort of discount or anything, claiming that \"he didn't write the menu.\"  I paid and left, and I'll never go back, simply because they're purposefully misleading and expect their drunk customers not to ask questions at the end of the night. \n\nAlso, the stalls in the women's restroom have no locks.  Charging five bucks for a plastic cup of beer, they should be able to afford to get that fixed.", "actual label": 0, "predict label": 0}
{"text": "I came into Wally's  last night for dinner with my wife and another couple. We were seated at a large round table in the corner on the patio. Our server Candy was amazing! What a gem she is. I have never had a more remarkable server. Seated next to us was a very large rambunctious group of ladies (if I can even call them ladies). The disgusting display of disrespect towards Candy was something I have never seen before. They were behaving like they were in a night club and to watch them bark orders at her and to treat her as if she was a slave to them was horrifying. But even more astonishing was how Candy carried herself through it all. That smile never left her face. I hope those women wake up today feeling completely ashamed of themselves, especially the one who did all of this in front of her teenage sons. I hope I never see any of the women in Wally's again and no server here ever has to go through what Candy went through.", "actual label": 0, "predict label": 0}
{"text": "Wanted to try this restaurant as we live nearby and couldn't figure out where to park. Finally we went around to the back and found only valet parking. We went to Rosie McCaffreys instead", "actual label": 0, "predict label": 1}
{"text": "One of my favorite places to get a drink and a great meal largely because you can't bet the beautiful and relaxing atmosphere! You can sit right next to the golf course while watching the sun set over the mountains and service is always fast and friendly", "actual label": 0, "predict label": 0}
{"text": "Had the Giglio pasta tonight. It was AMAZING! I usually don't write reviews, but I felt this dish exceeded expectations. Service was excellent!! Appreciate the attentiveness to our two children present as well. Thanks for making it a nice night out!", "actual label": 0, "predict label": 1}
{"text": "Course was in great shape and is reasonably priced for a TPC course. This is a fun course to play but is very tight! Great location right at the Marriott in Scottsdale and is convenient to get to from most places.\n\nThe people were friendly except for one guy in the pro shop. Interestingly the 18th hole is the only one where there were some quality issues as the fairway and green were not in as good of shape as the rest of the course.\n\nAll in all though, I would definitely return.", "actual label": 0, "predict label": 0}
{"text": "This course is on the less expensive end of the scale for Scottsdale which still means fairly pricey (I believe it was around $80-$90 per person in prime season in end of March?). There is no driving range but we went to one of the courses nearby beforehand which wasn't very far away.\n\nOverall though thought the course was pretty solid with a nice layout. Greens in good shape. Course had some challenges but also had an overall layout that seemed to keep the ball findable because everything sloped inward. Got out at 8:45 or so and played pretty quickly. Would definitely come back for more.", "actual label": 0, "predict label": 0}
{"text": "We have been coming here for years for sushi. Andy is a sushi master and we love him! Sit at the sushi bar and he will make you something custom based on what you like or dislike. He is incredible!!!!", "actual label": 0, "predict label": 1}
{"text": "We have visited this place multiple times over the past few years and when I found out they had a private room for me and my guests I was so excited! At first they were very accommodating, they let us see the room and discuss how we were going to set it up for our party and went over the menu's with us. It came as a big surprise to me when we showed up and had to wait over an hour and a half for our first course to come out! Everything just went downhill from there. We complained to our server multiple times (we had 1 server for a party of 40) that the room was extra hot and there was nothing done about it. I had about 10 guests having to get up to try and cool down outside, fanning themselves and sweating throughout the dinner. Then when half of our guests left I realized they never sent out dessert and we had to ask for it! I was then told we should have requested dessert to come out, what kind of restaurant waits 45 minutes to bring dessert after a meal is finished?\n\nMy BIGGEST disappointment was how the catering manager, Michelle, handled everything after I sent her an email. I understand that she is the owner's wife but I've had teenagers talk to me nicer than she did. She was brash and offensive. Not only did she not take blame for anything she blamed our party for all of the issues. You can count on the fact that I will NEVER recommend this place to anyone and will have negative things to say when asked; which is unfortunate because I work downtown and a lot of people always ask me for recommendations. I sure hope the lack of customer service turns people off from dining here, you are better off going to Cheesecake Factory!", "actual label": 0, "predict label": 1}
{"text": "Best pizza in town!  I live at 19th Ave and cactus so it's a drive for me to go but it's worth it.  I've been  coming here since I was in high school and I miss the old man  who used to run it but his son took over.  I've never had a problem here and have carried  out and eaten in its a great place!", "actual label": 1, "predict label": 1}
{"text": "I've been coming here for 24 years I didn't know that they changed ownership!  They took the pretty art off the wall wouldn't know where you are by looking no art at all looks like a bar and they changed the almond clicked it comes in big chunks and the vegetables too and they charged me for hot tea! Won't be back", "actual label": 1, "predict label": 1}
{"text": "Veggie burgers suck. Decided to try something new today... I totally regret that decision.  We got two different ones and they are horrible not to mention they took 20 minutes to get out and there were only two other tables there.  I won't be visiting there again... EVER", "actual label": 1, "predict label": 0}
{"text": "Ok so this place is no good in my opinion, would give zero stars if I could.  decided to try em out and ordered delivery a while back and when the food was delivered it was cold with hardly any cheese on the pizza, You could clearly see the bread throughout the whole pie. the wings were also cold. And to top it off the salad was soggy and seemed past it's useful date. Pretty much threw out most of the food because it didn't taste good anyway. Didn't even taste the salad for fear of food poisoning. For pretty hefty prices I was definitely expecting better. Big jimmy's is way better for half the price. I felt like I was ripped off. called them, talked to a staff member she assured me a manager would call. Long story short I called and called and never received a call back. Always just an excuse. \"I'm not authorized to issue a full or even partial refund, you'll have to wait for a manager to call you\" I must have tried 5 or 6 times. I wouldn't spend your money here. Pretty bad when you get beat by $5 pizza. what disappointed me the most was their lack of concern for a paying customer. A customer who has spent lots of money and used to regularly visit philly's bar and grill, which they are affiliated with.", "actual label": 1, "predict label": 0}
{"text": "Sienna Mercato is now on my permanent rotation list for my frequent trips to Pittsburgh. It's three levels of great service and delicious food. \n\nI started with a craft beer and beef tartar in the beer garden. It's a cool area with a clear roof and open terrace. This would be a great place to join a group of friends, drink a little beer and watch a game on the numerous TVs.  One end is open to Penn Ave.\n\nI then moved to the middle level where I had a good red wine and a very good bacon and clam pizza.  I like this level. I really liked the pizza. \n\nAnd, sadly, I'm too full to check out the first level. I'll save that for my next trip. \n\nAll in all, it's now in my top 5 in Pittsburgh.", "actual label": 1, "predict label": 0}
{"text": "I'm writing this review after about 5 meals at Seviche.  I highly recommend it to anyone looking for a deviation to the standard American fare.  I'm usually with 1 or more friends and we order a number of small plates.  It's fun to share the experience - and the beer and mixed drinks are a bonus.", "actual label": 1, "predict label": 0}
{"text": "I'm in Pittsburgh at least twice a month and The Proper is my go-to place.  The pizza is very, very good and the bacon candy should be illegal  (in a good way).  The really large draft beer selection is worth the trip by itself.", "actual label": 1, "predict label": 0}
{"text": "I have been hearing about Gaucho's for the past 2 years but only recently had an opportunity to go there.  Wow!  It was delicious.  I had the fish sandwich and then, a week later, had the steak sandwich.  This is definitely in my top 5 go-to places for anyone visiting Pittsuburgh.", "actual label": 1, "predict label": 0}
{"text": "It's not a waste of time - but I expected more.  There are a lot of Belgian beers, some craft beers and not much else. I've never tried the food so I can't comment on that.", "actual label": 1, "predict label": 1}
{"text": "To start, I'm ONLY giving this place 2 stars because the service wasn't terrible. \n\nAlso, if more people in Phoenix reviewed we could probably avoid most of these overpriced robberies. \n\nI ordered a cocktail that was actually pretty good. Something with sparkling wine and muddled sage I believe. My Mom had a mango martini. That was also pretty good. They are apparently 'known for their martinis'. Though I find it really hard to believe that they're known for anything. \n\nAs an appetizer we had caprese. It was 12 bucks and came with four tomato slices that were not ripe, four pieces of impostor buffalo mozzarella and a flake of basil. Hands down the worst I have ever had. \n\nNext came the salads. These were made up of a few greens and half a tomato. Seriously? \n\nFor my entree I ordered a mixed veggie type pasta with oil and garlic. 20 bucks down the drain. My boyfriend had the 'special' which was Cioppino. It was 36 dollars and his stomach is feeling ever dollar of it. \n\nWe took our left overs because we just do that and don't want to be wasteful. On the way home the smell of it was so bad we had to pull over to toss it out. \n\nThis place is a crock. They couldn't get me to eat here again at fast food prices. \n\nFor 4 people (And only 2 cocktails) our bill came out to 180 bucks. What a rip off.", "actual label": 1, "predict label": 1}
{"text": "Food was amazing chicken crispy full of flavor mac an cheese best I have had out of all soul food restaurant I been the customer service was awesome they gave me a sample of sweet potatoe pie ended up buying 3 was truly mouth watering I will be back for sure highly recommend if u want food that taste home-made will be back for sure....", "actual label": 1, "predict label": 0}
{"text": "My wife and I really enjoy coming to Pita Jungle for lunch and dinner.  The seasoned chicken and hummus is one of our favorites!  Service staff is always friendly and helpful with meal suggestions.  I would recommend!", "actual label": 1, "predict label": 1}
{"text": "Great little hidden place so you might be skeptical. But once you walk in they have great friendly family style service.  Fantastic food with fresh ingredients at a good price.  Glad I randomly stumbled upon this place.", "actual label": 1, "predict label": 1}
{"text": "I wish they didn't have to charge for lemons and jalapeño , and also someone needs to keep the men's restroom clean it's always dirty and full of graffiti. Is this to much to ask for? Anyway the food is good. Also it wouldn't be bad to replace all the light bulbs that don't work.... This restaurant is located in a nice area in Chandler, yet it seems dirty. Maybe is time for a new crew leader? Or maybe the owner is just a stingy asswhole :) good day", "actual label": 1, "predict label": 0}
{"text": "The cheese steak with sauce & onions is almost as good as the chicken salad; which rocks!", "actual label": 1, "predict label": 1}
{"text": "I have eaten here many times and it is always so good. The noodle dishes are soooo good my favorites are the pad zu and pad thi they are both my absolute favorite things to get. When u go there ask for the server leilani because she is great! She is sooooo nice and she makes great recommendations I also love how clean and tidy they keep the restraunt", "actual label": 1, "predict label": 0}
{"text": "Best sushi I've ever had!!! \nThe Oh My God Sushi is amazing!!! OMG!! \nThe philadelphia roll was awesome too!", "actual label": 1, "predict label": 1}
{"text": "I don't know why everyone says dinner wasn't fast enough. We went had some wine, relaxed and enjoyed. If you are looking for quick service go to eat n park. The short ribs were great and so was the staff. Wine glasses were kept full. No complaining here. We had a table of 8 and I would say we were there about and hour and a half. Will definitely return to try more.", "actual label": 1, "predict label": 1}
{"text": "The bartenders are rude, the people are snobs, and the drinks are over priced-other than that the place is great.", "actual label": 1, "predict label": 1}
{"text": "A guy made the best subway sandwiches I've ever gotten. Said he's been working there 4 years and that he was 19. Whoever that guy is... Deserves an award", "actual label": 1, "predict label": 1}
{"text": "So I heard this place gave out a free rose and a free desert to any mother who ate there on Mother's Day, how awesome is that ! ! ! \n\nBut I absolutely love the food here at Bella, just had a slice of mushroom today, apparently you can get a slice of whatever the heck you want any time of day, but my all time favorite is the Bella Delight... Fried eggplant covered with ricotta cheese, Italian sausage, homemade marinara and mozzarella... And then they bake it. No wonder I eat here all the time.", "actual label": 1, "predict label": 0}
{"text": "Awesome food and great music. A must eat with authentic Mexican food. Not the Tex Mex fast food crap!!! The homemade wine is divine! The home chocolate ice cream is fabulous and so yummy!!", "actual label": 1, "predict label": 0}
{"text": "We went to Cafe Sam to celebrate 2 birthdays. Service was slow. Downstairs was not to busy. Four out of seven meals were unedible. Steaks we found out were from last week for Valentines Day. The steaks were tough needless to say. No bread. I had to ask for our salads. Manger Dan really was passive in talking to us. He did give us alcoholic drinks which was nice but I don't drink alcohol. The only thing that was great was conversation with friends.", "actual label": 1, "predict label": 1}
{"text": "I had the #17 combination with shrimp. The shrimp was cold and the sauce had too many onions and peppers. Be sure you pay with cash as they charge an additional fee for using debit card.", "actual label": 1, "predict label": 1}
{"text": "The quiche Lorraine was the worst I've ever eaten. It was runny, greasy and looked like it was barely cooked. I won't ever go back.", "actual label": 1, "predict label": 1}
{"text": "i wasn't in an objective frame of mind, given that i was a visitor from another state and was willing to try just about anything local. that said, this place left a smile on my face.\n\nmaybe it was the 1950s-era big neon sign out front. maybe it was the fiberglass horse on the roof. maybe it was the kitchy old-school cowboy-themed decor inside. maybe it was the fact that our waitress wore a holster and 6-shooter. or maybe it was the sawdust all over the floor.\n\nside note: sawdust? really? WHY? aren't they concerned about people slipping and hurting themselves?\n\nwe ordered breakfast and it was good. it's hard to screw up eggs, hash browns, and bacon, and they didn't. yum.\n\ni'm glad we didn't go to IHOP.", "actual label": 1, "predict label": 0}
{"text": "These are definitely the best Bagels in Arizona. I haven't been able to find a good NY bagel for awhile. Will definitely be back!", "actual label": 1, "predict label": 1}
{"text": "This place is definitely not your ordinary pizza place. Wow!!! Love at first Bite!\n\nThe name goes with the pizza. The crust was nice and Crisp, and you can tell they use quality ingredients \n\nI would definitely recommend checking this place out! I now have a new favorite pizza place in the valley.", "actual label": 1, "predict label": 1}
{"text": "Great food and service. Spinach enchiladas are my favorite. Beer is ice cold", "actual label": 1, "predict label": 0}
{"text": "Horrible service. First, I wanted it to go and it was presented to me for dine in. Second, the sandwich was wrong, even after I asked if it was a BLT with Avocado. Good thing I checked before I left. And there was no acknowledgement of the inconvenience and wait time. That goes a long way. Will likely find another Einstein to go to.", "actual label": 1, "predict label": 1}
{"text": "In town on business and a friend recommended this place. I must say the food & service was outstanding! Had the Thai tacos for an app and the Cowboy burger as my entree. I'm from TX and have eaten a lot of beef in my time and their burger was damn good! Has my seal of approval.", "actual label": 1, "predict label": 1}
{"text": "Great food...very affordable...the momos, especially are amazing ...they also provide free wireless..", "actual label": 1, "predict label": 0}
{"text": "The staff is all super friendly. The atmosphere isnt divey, depending on who else is eating there. I really like their Pho. It is great when you are not feeling well and will most likely leave you feeling better. I always get it with meat but end up getting seconds and thirds of their rice noodles before even touching the meat. The soup is so delicious by itself.", "actual label": 1, "predict label": 0}
{"text": "The menu at this place was almost too much. I wanted to try it all. I opted for the pancake flight (try the peanut butter cup ) their house made chicken sausage was also amazing. Cool retro decor. Highly recommended", "actual label": 1, "predict label": 0}
{"text": "I'm not one to gush but what a great place.  This is better than NY pizza.  Everything is fresh and flavorful!  Garlic knots were crusty on the outside, soft on the inside and did I mention the flavor. The staff is fun and attentive.  Can't wait to come here again!", "actual label": 1, "predict label": 0}
{"text": "The Garage does not have great food....but it is a great place to go for a late night cocktail. When I'm not in the mood to be in a bustling bar, but just want to go somewhere for a nice conversation, this is usually my stop.", "actual label": 1, "predict label": 0}
{"text": "Yes...the service sucks. Yes...the ambiance leaves you wanting \"more\"....but who cares! The food is amazeballs! Best chips and salsa in town and I have never had a bad thing off the menu. This is legit Mexican food and if you are a foodie, you will not be able to shut up about how good your food is while you are eating it. I hope the bad service and horrible decor don't kill this restaurant because the thought of never having those flour chips again makes me wanna cry.", "actual label": 1, "predict label": 1}
{"text": "Ollie Vaughns is adorable! had the grilled cheese without mushrooms and added tomato. It was heavenly...crispy on the outside and melt in your mouth juicy on the inside. Yum!", "actual label": 1, "predict label": 1}
{"text": "So...I'm not usually one to frequent corporate restaurants....but I can't stay away from those dang frozen margaritas! If it wasn't for them, we wouldn't eat here half as much. I would give the menu 3 stars, but there are two great things on the menu. The chili pork verde and the diablo chicken pasta. Can't go wrong there...and the Tejas trio is great to snack on if you just want a small bite.", "actual label": 1, "predict label": 0}
{"text": "This place is awesome.....food is amazing. The sauce is to die for. The fries are so good and the service is amazing as well. Please go try for yourself. I love this place.", "actual label": 1, "predict label": 0}
{"text": "OMG that food is amazing. I got the chorizo breakfast crepe burrito. So amazing. Lattes are amazing too.", "actual label": 1, "predict label": 1}
{"text": "Let me start by saying I love Taco Bell, but this one is the worst one I've ever been to. More often then not when I order something, it comes out wrong. Last week I asked for a Cheesy Gordita Crunch with no spicy ranch, a burrito supreme with no sour cream, the burrito came out right but the Gordita had that awful sauce on it. It took the woman taking my order about 4 minutes to figure out how to put it in, which ok they had a new system so I'll cut them some slack but still. Today I went and ordered a single Double Chalupa, 10 minutes later I went back up and they said \"they're making it now\"...seriously? A one item order and they wait till someone is basically out the door to make it. The best part when I said \"don't worry about making it just give me my money back\" they looked like I just asked them the mathematical formula for calculating the speed of light. I'm happy y'all get $11 bucks an hour now but seriously try to not suck at your job.", "actual label": 1, "predict label": 1}
{"text": "The best Italian Restaurant in the valley by far! The best food, the best service, the best prices. I ordered the VEAL Parmigiana and it was very tasty, tender and prepared the way it should be - Authentic Italian to the bone! I also ordered the soup of the day - Clam chowder and it was absolutely superb. You cannot do better for Italian food anywhere. Sorry, does not get any better than here. I intend to go back and bring as many people as I can with me. Great dining experience. A \"must try\" restaurant, by all means.", "actual label": 1, "predict label": 0}
{"text": "We were in Pittsburgh for a special occasion and decided to try Meat and Potatoes. We had a reservation and we were seated right away. I loved the atmosphere. It was pleasantly full but not crowded. No tvs at the bar which made for a lovely ambience. Our reservation was for later in the evening so the restaurant seemed to clear out with the theatre crowd. Our waiter was great, attentive without being overbearing, knew the wine list backwards and forwards and was lovely. We got the fried chicken livers and Cobb salad and then the steak for two with a chocolate dessert. All of it tasted delicious - well seasoned and generous portions on the sides. The only very minor drawback is the two top tables are very close to each other and it feels a bit like you are dining with the couple next to you. I would definitely recommend to friends who visit Pittsburgh.", "actual label": 1, "predict label": 1}
{"text": "This is the best Caprese salad and pizza that I have ever had. We go to this place once per week. I am addicted to it. The service is superb!  You cannot get better than Pizzeria Bianco at Town & Country!", "actual label": 1, "predict label": 1}
{"text": "Went tonight on a recommendation and was horribly disappointed. We often go to Genghis Grill and love it so we wanted to try this. This doesn't even come close. The meats looked like frozen, rolled up lunch meat. Veggies looked ok. Wasn't really any taste to the bowl unless you drenched it in teriyaki and soy sauce. My man didn't even finish his food and that never happens. Even the frozen yogurt didn't taste very good. They have toppings for 25 cents each from a gumball dispenser. We definitely won't be coming back. We'll stick to Genghis Grill.", "actual label": 1, "predict label": 0}
{"text": "Firebirds. It was in a word fantastic. The service and the food were above board. I will definitely be back.", "actual label": 1, "predict label": 1}
{"text": "Was not a fan. The service was horrible, pork was chewy and they were out of mac n cheese. The only good thing was they had Big Red on the fountain. I will not return.", "actual label": 1, "predict label": 1}
{"text": "One of the better Chinese restaurants out west here.  Spoiled by East Coast Chinese food (where you can actually get duck sauce)  Restaurant is clean and owner & staff are very friendly & accommodating.  Love the Sesame Chicken & Orange chicken.\nActually used them for my daughter's graduation party last year and they were great; lots of food at a great price.\nCheck it out.", "actual label": 1, "predict label": 1}
{"text": "I've been searching for a \"bar pizza\" that I grew up on back East and Luna comes the closest.  I've been here 5 years and have tried just about every pizza around and was very disappointed.  Luna helps me make it through to my Boston visits.  The chicken wings are also very good.  It's a 15 min. ride but worth it.", "actual label": 1, "predict label": 0}
{"text": "1st time visit. Read several positive reviews and thought it would be a good place to take my daughter visiting from Boston. I had the pulled pork and it was excellent. My wife had the fish (MahiMahi) & shrimp and loved it. Both daughters had chicken, orange & lemon pepper, and were very happy with it. Very generous servings. Sides of crab rangoons, cabbage & sticky rice were all very good. Ordered the seafood soup w/crab, shrimp &scallops. That will have to wait for home...too full   \nWill definitely be back & spread the word", "actual label": 1, "predict label": 1}
{"text": "I love this place. Always fresh food and a great place to just have a nice breakfast or brunch either alone on the patio..or at the bar with as few friends. My absolute favorite is the french toast with strawberries...yummy", "actual label": 1, "predict label": 1}
{"text": "Love it.  One of my favorite things is the hummus. Yummy. The staff are all very nice just a cool place to relax and unwinfld after a long week.", "actual label": 1, "predict label": 0}
{"text": "I went in not expecting much, but Turkish Grille blew me away. I got the Chicken Kabab plate and it was delicious. The Chicken was perfectly cooked with a nice char on the outside, but still juicy on the inside.", "actual label": 1, "predict label": 0}
{"text": "Good food, just a little over priced considering it's proximity to CMU. It will scratch that itch for Chinese food if you have it, but the food isn't anything special. Their Crispy Orange Chicken and Broccoli Beef are my go-to entrees.", "actual label": 1, "predict label": 1}
{"text": "A local establish that has a loyal following. No real bar for cocktails but ample beer selection. \n\nI was impressed with the servers knowledge and courtesy. It's hard to find great service and this is a four star service parlor. \n\nTwo styles of crust. Thin or original. I would order original for take out because it holds up better. Thin crust is NYC style thin crust. \n\nThis is not Papa Johns quality and the prices reflect the difference. Large cheese, large pep, sausage, onion and mushroom combined with a family size salad was 61.00. Not cheap but the quality is clearly different. \n\nPizza was above Papa John's and below lombardi's. \n\nSalad dressing (house) was excellent. \n\nOverall, I would go again but wouldn't drive out of my way for the pie.", "actual label": 1, "predict label": 0}
{"text": "Here's the deal. This is a four star Mexican restaurant if the kitchen isn't jammed. I rated this three stars based on the food quality when busy. I love the polo fundido dish and the guac is above average. Pork stew and melted cheese apps are four to five stars. Go when it is slower and you will be happier.", "actual label": 1, "predict label": 1}
{"text": "After being bitter and insulted over being hit up for a cover charge on one Saturday evening I am adjusting my review. This is our local bar and I have had many great times as the service is always good and the food even better. I took my frustration out in a business that didn't deserve it. Great food and people . Not a fan of the new Saturday night Dj/cover but to each their own there is a place for everyone. My apologies for my anonymous poor review this is a way better place then I gave them credit for. Perhaps a breathalyzer on my yelp account would be helpful", "actual label": 1, "predict label": 1}
{"text": "Very pricey and not much food for your money.  We were fed piece meal and everyone finished what food they were given before the entree was finished.  Won't go here again.", "actual label": 1, "predict label": 1}
{"text": "Very expensive for the amount of alcohol in the margaritas.  Very small portions for the money.  Terrible service.  Waitress never checked on us.  Go to Arribas!", "actual label": 1, "predict label": 0}
{"text": "Amazing food, amazing service!! I would recommend Blue Adobe to everyone!! The portions are large and the menu has so much to choose from!! The live music Saturday night was great! We usually go to the one in Mesa, but I will go to this location from now on!!", "actual label": 1, "predict label": 0}
{"text": "AMAZING ETHIOPIAN FOOD!!  Literally the best we've ever had and we've eaten at so many different African restaurants across the country!  It came out very hot and fresh, the owner and sweet cook in the back couldn't be nicer!  Not really situated for larger parties, there were four of us and we ate outside as it seemed easiest with the small tables.  They specialize in take out and delivery.  \n\nI wish we lived here and could visit all the time!  \n\nFantastic vegan foods and the best part is you get to choose your own combo!", "actual label": 1, "predict label": 1}
{"text": "We ordered 4 takeout chicken items, which were just ok to barely edible. The biggest problem was how greasy everything was... We don't plan on coming back.", "actual label": 1, "predict label": 1}
{"text": "Excellent Mediterranean style food, nice ambience, cool artwork on the walls, friendly staff -- I hope they can keep up the high standards.\n\nWe were a party of 5 and went rather late on Sat. night.  We got great service and enjoyed the reverse happy hour specials (try both shrimp items...) along with a range of pita sandwiches, a salad and the shrimp skewers.\n\nThe one item that could have been better was the mushroom pita, which was rather soggy.", "actual label": 1, "predict label": 0}
{"text": "Having had Chinese food in India while growing up, we went with a lot of anticipation. Amongst the ten of us, we ordered some twelve dishes, including hakka chicken and shrimp, chicken 65, chili garlic noodles with chicken, garlic pepper chicken and shrimp chop suey.\n\nThe Chicken 65 was very good, with slightly tangy pieces of boneless chicken that had a crunch on first bite, garnished with red and green bell peppers. The chili garlic noodles were tasty, but we initially thought there was a mistake with our order since we could not see any chicken in it.  On close inspection, we noticed a few miniscule pieces of chicken... The shrimp chop suey was about average, although the few shrimp were rather small. The garlic pepper chicken was neither garlicky nor peppery, instead swimming in a pool of watery gravy. But the biggest disappointment was the hakka dishes, which are a signature Indo-Chinese noodle dish.  These were completely bland, and we had to resort to adding more than a few dollops of the 6 sauces at the table to pretend we were having Indo-Chinese cuisine.\n\nWe wished the portions were more generous, like we get at most Chinese restaurants. We had to order a couple of extra entrees since some of us were still hungry, whereas we almost never can finish our food at other restaurants.\n\nThe service was competent bordering on perfunctory. One of us was curious about Nasi Goreng on the menu, but our server could not describe how it was prepared, instead steering us to a couple of other choices on the menu.\n\nOur receipt invited us to share our experience at a \"Talk2us\" link, which only produced a \"survey error.\"\n\nHaving had great Indo-Chinese food in Calcutta, Vancouver and Houston, we are still waiting for a comparable experience in the Phoenix area.", "actual label": 1, "predict label": 1}
{"text": "Still rest as ever.  Same great food st the new ( any only) location at Campbell and 16th Str.  In a sea of change this place never disappoints me since the 70's st Christown Mall.  Can't go wrong with the Pastrami with Swiss on Onion roll.", "actual label": 1, "predict label": 0}
{"text": "Gave this 5 stars, but it's NOT fancy or upscale at all, just so you know that. What it is: Excellent food (see the other reviews), service (very pleasant & attentive, desire to please), & an excellent Value! \n\nI had chicken taco's and my gal's beef (marinated) taco's were even better. (Soft tortilla's were hand made (they said) as ist all the food. Rice and beans were good (which for me means not fancied up or spicy). The Salsa was amazing!!! I always said you could make millions if you could get the roasted tomatoes and chili flavors w/o the burn/pain (I'm sure you can ask for the hot stuff if desired). Well they did it.   Margaritas were excellent (unfrozen w/ salt) Owners were most gracious named ,\"Beth and Bill\" (not the radio personalities). \n\nVery relaxed atmosphere (jeans are great as goes for all of cave creek) w/ a few small TVs around over on the bar side at least (no sound heard, which I preferred). \n\nMariachis (probably just because it was Valentines) were a nice touch for the occasion, ... bit louder then I prefer, but they were very good and had the tact to not come over to our table since we didn't make eye contact. Nice voices and instrumentation to be sure. \n\nHandi-capped friendly from what I remember. Private parking on the side was pleanty for a fairly busy Sat. night (w/ more out back). Light gravel made for no dust, and wasn't too thick so I'd guess wheel chairs wouldn't be a problem. \n\nNot sure about reservations as we stopped on a whim, but with immediate seating on Valentines, I'd estimate no problems getting in,..least till the mobs at El Encanto find out about this place. :-) \n\nAm looking forward to one of their breakfasts.!\n(would have probably gone with 4.5 stars if able.)", "actual label": 1, "predict label": 1}
{"text": "Excellent breakfast food and staff!!!! Great for a Sunday of chilling and drinking! The wait staff was great and friendly and really on top of drinks.  The food was served fairly quickly with local fresh ingredients. We will be going back in the future to taste more of the menu", "actual label": 1, "predict label": 0}
{"text": "Pros: Private parking lot, burger, service\nCons: \n\nIs it a good restaurant for kids? Yes\nIs it a good choice for big groups? Maybe\n\nThis is a past experience review. On Thanksgiving Day around 8:30PM, we did not have so much effort to find a place to leave our car there. The hostess was very friendly and nice and directed us to our table without any need for waiting. Obviously the restaurant was almost empty due to the holiday.\nThe dining room was huge and there is a sundae bar that we got very tempted to eat there after the dinner. The waitress was very nice and friendly and was always checking our table to see if we needed something more. Because we were craving for a burger, my wife and I decided to build our own burger.\nOverall, the experience was fantastic! The burger was big and juice and not greasy and the fries were delicious too. This is the type of restaurant that I will have as a first option when I go back to the Pittsburgh, PA again.", "actual label": 1, "predict label": 0}
{"text": "The food was good but the service was not. It seemed that the manager was doing more effort to serve us food than the attendant. My experience with the au bon pain on Boston was so far much better than this time.", "actual label": 1, "predict label": 0}
{"text": "Good service but not so good food. I already ate on many tgi Fridays and this is the first one where the food was not good. Will not come back again.", "actual label": 1, "predict label": 0}
{"text": "Pros: Private parking lot, barbeque, buffet, hostess, service\nCons: Be in Pittsburgh and not in Buffalo\n\nIs it a good restaurant for kids? Yes\nIs it good choice for big groups? Yes\n\nThis is a past experience review. Around 7:30PM, the restaurant was not crowded and there were still available many sits there. The hostess was very friendly and nice and directed us to the table without any waiting time. The parking lot is shared with the other stores of the mall, but because it was night and most of the commerce around was closed, so we can say that was a \"private\" parking lot.\nThe dining room was an excite place, really remembering a churrascaria on Rio de Janeiro. It made me feel home sick (what is good). The waitress was very nice and friendly and was always checking our table to see if we needed something more. Because this is a Brazilian barbeque place, my wife and I went there looking to eat a rodizio.\nOverall, the experience was fantastic! Because they know how to cut the meat on a Brazilian style and they offer Brazilian goodies to consume there too like Guarana or Brazilian coffee. After the dinner, I talked with the owners and found that they are Brazilians. So, if you are really looking for a place to have a real Brazilian barbeque experience around Pittsburgh, PA, this is the place. I'm still trying to find a good excuse to travel again to the city and eat there again!", "actual label": 1, "predict label": 0}
{"text": "Very good foods. Owners are superb nice. Parisian omelet is to die for... Cozy atmosphere. Reminds me of the cafe I frequented in Paris.", "actual label": 1, "predict label": 0}
{"text": "I tried this place after seeing reviews about PHX Burrito House. The foods are so good. Pork in green chile burrito is heavenly. Homemade guacamole. Yummy! I come here often.", "actual label": 1, "predict label": 0}
{"text": "Incredible food at a great price point. The only thing I found strange was the ordering and service aspect, it doesn't make a lot of sense to have it set up the way that it is. You order at the counter, get your own drinks unless you order alcoholic drinks, and get your own condiments and napkins. Why do I need a server, and why would I tip that person? Anyway, the food, drinks and ambiance are great. If they were to change the service format, I would give them 5 stars. Check this place out.", "actual label": 1, "predict label": 1}
{"text": "Very limited menu, which was disappointing. The appetizer was lack luster, as it was only melted cheese and oil, which came out burnt and very greasy. The tacos were decent, but lacked imagination. The sangria was very run of the mill, and the service was atrocious. I have to say, we were very disappointed. It's over priced, and the hostess spilled sauce all over us, and did not even have the decently to apologize. We will be taking our business to other options, and will never come back. Go to Blanco or any other Fox concept, the food, ambiance and service will blow you away.", "actual label": 1, "predict label": 0}
{"text": "Incredibly slow service, with cold food being brought to the table. I will give them another chance, only because the food showed promise. Don't eat here if you're in a hurry!", "actual label": 1, "predict label": 0}
{"text": "This is definitely my favorite spot to grab a beer in town. They always have a great selection of rotating beers, and the food is amazing as well. If you're looking for coffee, they have a nice selection, and live music most nights. It's never had anything but a nice atmosphere, with a friendly staff and friendly regulars frequenting this place. Check it out.", "actual label": 1, "predict label": 1}
{"text": "Everytime we come here the service is great, the food is great, and we realize each time why we come here: there is nothing like it in town. If you haven't been here, you have to check it out, you will not have a better meal for this price point anywhere in town. I recommend it to everyone I know, and they all agree, this place is something special. Nice job, guys.", "actual label": 1, "predict label": 1}
{"text": "Food is OK but way overpriced. \"Hot\" brisket sandwich was COLD. Chicken Parmesan sandwich was wrapped in tin foil. I had to pick foil out of the cheese.  I won't be returning.", "actual label": 1, "predict label": 1}
{"text": "Not at all a good place to eat for Vegetable Manchurian and Pani Puri both were not at all good and expensive. Pani Puri they just gave potato pieces boiled and put in the puri with no salt, no pepper,no chick peas...I would suggest not to go to this place for eating chat.", "actual label": 1, "predict label": 0}
{"text": "So, interestingly enough, I was reading the reviews that the food was good (or great) but the service was terrible... honestly, I had just the opposite experience. The food could have been a lot better (I mean, the soup was almost cold), and the pasta flavor was very bland, but our waitress, she was a delight! If I remember correctly, I think her name is Jane (though memory could betray me). She was on top of her game- she is the only reason why I gave this place a 3 stars and not one.\nShe made appropriate suggestions, was fast in processing our orders, and had a very pleasant personality. I sincerely hope Mimi's Cafe improves their food, otherwise, because in the restaurant industry, it's not just about the service or the food, it's about having the best of both worlds!", "actual label": 1, "predict label": 0}
{"text": "The food in this place is indescribably awesome! Granted, the place could be nicer, but if you're in the mood for great food without the frills of a great looking place: this is it. The service is fast, friendly, and the prices are great- especially knowing that their portions are typically huge. I can't finish my plate most of the time, so I always end up taking leftovers home. \nI love their Jade Red Chicken, as well as their emerald chicken. Their black beans are to die! Order a combo plate, if this is your first time here. You'll get a good mix of everything and you'll leave without regrets!", "actual label": 1, "predict label": 1}
{"text": "Amazing food all around. The steak sandwich is scary good; burgers as fresh as you can get. Steaks and salmon? OMG what a meal. You gotta check this place out.", "actual label": 1, "predict label": 0}
{"text": "The food is horrible and the service worse. Not bad people, just not very capable.  Slow and 'Houdini-like'. The food itself is very average.....typically the TK chains have cute girls behind the bar...  This place is all dudes in skirts. Don't waste your money here", "actual label": 1, "predict label": 0}
{"text": "Two stars b/c Sara our server was uber-professional and spot-on. It started off with the dual hostesses pointing our 6 top group to a booth in front of the door on a freezing night but the table across the aisle had 6-8 coats hanging on the hooks for our booth and we couldn't get in. We asked for another table and were treated like idiots for even asking such a stupid question. After openly scoffing and scowling at us we got another table. Right next to a group of a dozen 7-8 year olds who had no adult supervision and ran around screaming and throwing shit around the room. We actually pulled our tables back from them to give them more running room. After all this crap the food came out and was  - meh.....\nOur server was great to us and embarrassed for the restaurant itself...\nStay away from this place...there a ton of better places in the Waterfront", "actual label": 1, "predict label": 0}
{"text": "Good food, cold drinks at reasonable prices. BUT.... there's only 1 cook and 1 bartender. The bartender has to sling drinks and food to the entire place so service is extremely slooooowww.........", "actual label": 1, "predict label": 0}
{"text": "Went to Hanny's at 9:00 p.m. and had drinks and a meal - with a party of seven.  We were seated immediately, but the place filled up and was busy by 9:30 p.m.  Service was slow, but in defense of our waiter, he appeared to be handling about half of the tables.  Food was excellent.  We ordered three pizzas: carne, prosciutto, and blanco.  I love meat, and assumed that the carne pizza would be my favorite.  It was great, but the prosciutto was better.  This pizza is every bit as good as Bianco's, if not better, and you can get in without being made to feel like the object of condescension.  Finally, they have a five dollar martini that was excellent.  (Don't forget to have the donuts for dessert.  They are good - but I think in the past they were better.)  My wife had the beet salad which was a little light on beets and heavy on arugula.  Otherwise, outstanding food, even the \"onion strings\" that we had as an appetizer.  (Oh, and the atmosphere is very cool, from the elevator shaft, to the lighting to the old signs.)", "actual label": 1, "predict label": 1}
{"text": "I have been twice, each time for a chili dog to go.  It's an easy order, but the first time it took almost ten minutes, despite few customers, and the second time about half as long.  Both times an employee asked what I was waiting for, and only then did they find my order.  I was not the only person that waited, on each occasion, for an inordinate amount of time for an order.\n\nThe first time a manager felt bad about how long I had been standing there and \"comped\" me some fries, which I threw away because they were soggy and just gross.  The second time, despite ordering it to go, the chili dog came in a basket to eat \"in\".    \n\nThe chili dog had onions on it (nobody asked if I wanted onions) and the cashier was effectively hidden behind a stack of styrofoam cups. The chili dog was slightly better than a 7/11 product, but at almost triple the price and with a long wait.  Another customer had a gyro, which looked appetizing, but I am not sure I will be back to try it.    \n\nI was hoping for someplace where I could grab something to bring back to the office but it doesn't appear that this is the place.  Huge space, with a small crowd (five or six employees or more, and approximately ten or fifteen guests).  Until they improve how fast the food gets out, the crowd will dwindle even more.", "actual label": 1, "predict label": 1}
{"text": "Need to come back to give it five stars!  Great service with attentive staff.  Sat outside with a few flies but not bad.  Inside looked great and outside was perfect for having grandkids with us.  All of our dishes were well received: hash, breakfast chimi, hamburger and baked cauliflower.  I don't like cauliflower much but this was delicious.  Baked with lemon and still crisp it's a must try.  Burger was good, fries better.  Pancakes weren't bad.  Toasted brioche was good but could use a second egg. Prices were acceptable with a bottomless mimosa for 18 bucks. We'll be back.", "actual label": 1, "predict label": 0}
{"text": "Mondays are best at Maizie's when they have their signature burger on sale.  The burger is a good size (half pound) for sharing and comes with lettuce, tomato and onion and your choice of cheese. Any other time get the inside out burger - a burger stuffed with blue cheese.  My favorite.  \n\nAnd whenever you go, have the wingless buffalo dip. Good cheese with chunks of chicken and lots of spice served with chips and pita bread. It is required eating. \n\nFinally, Maizie's has beer and wine specials that go well with their menu.  There are a couple of tv's that always have games on and the service is usually pretty good.", "actual label": 1, "predict label": 0}
{"text": "We've been to Otro many times. Stick with the tacos or the chorizo and egg dishes.  They are consistently delicious. The margaritas are good.  The guacamole is good and sometimes excellent and the chips are crisp.  We have had one bad experience there but the situation was immediately addressed by a manager and the bill was graciously adjusted.  Service is usually excellent and the atmosphere is cool. Sit at the bar and watch the bartender make drinks - it will give you an appreciation for how hard thy work and what goes into some of their drinks.  Didn't care much for the paella but on the whole we like just about everything else.   (Sit away from the west facing windows in the late afternoon as it is hot!). This is a perfect place for a casual dinner. The background noise is low so you can enjoy conversation and the food.", "actual label": 1, "predict label": 1}
{"text": "Went at 4:00 on a Friday afternoon. We had two little girls with us and the bartender was great, got them lemonade and cookies and popcorn.  I had a great ale, while my compadres had a flight of red wine and a flight of white wine. Prices are ok, with a special of buy a flight get a flight for half off. $22 for a flight with some pretty tasty wine from Macedonia (although not all were great). Excellent atmosphere and a good crowd. Even thought the prices are a bit high compared to other happy hours we will go back.  This would be a great place for later in the evening.  Just beer and wine and a very limited food menu.", "actual label": 1, "predict label": 0}
{"text": "Objectively: $93 for an 8 oz filet (with a potato cake), salmon, Brussel sprouts, and a carafe of wine. Plenty of food for two people.  Subjectively: great.  The steak had a fantastic sear on it with a peppery taste and the meat was done perfectly, still juicy and tender. The salmon was moist and flaky.  I even liked the Brussel sprouts that were shaved and toasted.  (And I don't like Brussel sprouts!).  The potato cake had but one problem - too small.  Otherwise a near perfect tasting dinner.  Del Frisco's is an anomaly - hardly ever packed but turning out some of the best food. This steak certainly was on par with Durants and Donovan's.  (The ambience is in keeping with a \"grill\" and could be changed to make it a more intimate setting.). The carafe was a good deal at $19 and gave us almost four glasses of wine.  Enjoy!", "actual label": 1, "predict label": 0}
{"text": "Warm atmosphere, smiling faces and cold beer!  Oh and a great menu with excellent food. Try the meatballs and the mignulata. Very delicious. Pizza choices include tasty standards like sausage (from local favorite DeFalco's) and more trendy tastes like fig and goat cheese. I wish it was closer to home. We would have our own permanent table!", "actual label": 1, "predict label": 0}
{"text": "One of our favorites restaurants. Slightly higher priced than some restaurants but definitely worth it.  Portions are very generous and food is fantastically flavorful.  Nice ambiance too, think casual elegance.  The rice is the best anywhere around.  They also have some additional unusual varieties of rices for those who want to be adventurous. The multiple protein plate options on the menu give a nice variety.  The koobideh (spiced minced meat kabob) is so delicious here.  Something really nice is that you can get koobideh as a side order to an entree which is a great deal and allows you to try multiple things. If you have not been to the Persian room definitely make it a priority to experience this wonderful place!", "actual label": 1, "predict label": 0}
{"text": "Great customer service.  We had to wait a while for our dessert so when we asked how much longer they apologized for the wait & said it was on the house which was really nice. Then when we went to pay they had taken the drinks off as well for any inconvenience which shows they really care. Food is good. Macaroon ice cream sandwhich was great. First time trying Pandan flavor ice cream and highly recommend it.", "actual label": 1, "predict label": 0}
{"text": "Really like Kawaii for multiple reasons. We first tried this place with a discount offer and it happened to be during happy hour. They were happy to honor the discount on the happy hour specials too which is something we appreciate as it shows they are not petty and that they care about customer service.  We ordered some extra stuff because of this just so they did not lose money on us. Their kindness payed off with good karma. \n    We have been back several times and had sushi rolls.  However, my husband does not like seaweed so ask the rolls to be made with soy paper instead.  They were happy to do it and did not charge anything extra for it unlike many other sushi places that will add an extra charge. Once again we really appreciate the customer service. \n     Another thing they have is a Sunday brunch all you can eat sushi offering. This is unusual in Arizona and love that they do it. Going out for sushi can often add up quick no matter were you go and for what a few rolls might cost you could do all you can eat at Kawaii during Sunday brunch.  Now they do limit the sashimi to 4 slices of each type of fish but no limit on rolls or nigiri and furthermore it includes for no additional charge some appetizers and drink options as well which makes it a nice experience.", "actual label": 1, "predict label": 1}
{"text": "Enjoyed Greektown.  Much better than other Greek places around that we have tried.  Did feel it was just slightly overpriced compared to portion but food was quite good. \n     I love cheesecake and was a little surprised they had a cheesecake as an option for dessert and it is clearly home made because they were baking it and had to see if it was done before we could order it. It was an exceptional cheesecake but also a little different than the usual cheesecake.  Guessing there is Greek yogurt in there but not sure.  Anyways, delicious!  \n     This is a family run place so in my book that is a plus.  We left payment and tip on the table and left.  Next thing we know the owner George comes out into the parking lot to catch us to say thank you and goodbye.  Most places would not do that. Clearly shows they care.", "actual label": 1, "predict label": 0}
{"text": "Ambience on point. Location is prime. Friendly yet knowledgeable service. Some may think the food is pricey but the quality is definitely fair for the price, not to mention killer happy  hour specials.", "actual label": 1, "predict label": 1}
{"text": "Drive through health conscious food? Count me in. Delicious salads and wraps. Even tried a juice and was impressed. Will continue to drive through!", "actual label": 1, "predict label": 1}
{"text": "Large restaurant close to Old Town and Arts District of Scottsdale. Very good traditional Mexican food.  Two kinds of salsa and chips.  Large portions.", "actual label": 1, "predict label": 0}
{"text": "Just finished a terrific dinner at this great barbeque restaurant.  From the sangria, frozen lemonade and cornbread to the baby back ribs, mac & cheese and coleslaw, it was all excellent.  Service was friendly, portions were generous and food was out very quickly.  The free take away bag of sugar donuts was a wonderful end for a delicious dinner.  Even at 5:30 on a Sunday night the restaurant was full and a reservation helped us to be seated promptly.", "actual label": 1, "predict label": 1}
{"text": "Delicious Pad Thai!  May not look like much from the outside, but it's worth going inside!", "actual label": 1, "predict label": 1}
{"text": "Best food I've ever eaten!  Would recommend this place to everyone!  Can't wait to go back!", "actual label": 1, "predict label": 0}
{"text": "Casa Reynoso is consistently serving 5-Star quality traditional Mexican dishes with excellent service! My favorites are the Flour Cheese Crisp with Green Chile and Green Corn Tamales with a large order of rice!!!!! It's always a pleasant experience dining at this restaurant! Appreciating the great food and welcoming hospitality my overall rating for this establishment is 4.5 Stars, leaving them room for growth.", "actual label": 1, "predict label": 0}
{"text": "It was great! Great customer service! I definitely recommend anyone looking for good pizza & wings, to stop by Barro's! We were greeted immediately once arriving, & were asked to have our order takin. She even gave us an extra cup! Our food was served promptly and it was delicious!", "actual label": 1, "predict label": 0}
{"text": "Taking a bite of their sweet potatoes is like taking a bite out of heaven. Their chicken is fried to perfection and their Cobbler was made to a standard that only Chuck Norris could possibly compete with.", "actual label": 1, "predict label": 1}
{"text": "I came here for Valentine's day and was seriously disappointed. Walking into the place, there was no host to greet or seat us. We had reservations and ended up walking around the empty tables looking for the one with our name on it. We finally chose a table and the food was pretty good, but my date asked for a steak knife to cut her lamb with, and our server said the place had no steak knives. Also our wine was served in tumbler glasses", "actual label": 1, "predict label": 1}
{"text": "Thus place may seem small, but their flavor is huge. A little out of the way but totally worth it. Chicken tacos on point.", "actual label": 1, "predict label": 0}
{"text": "I ordered from here online and I was very impressed at how quickly and accurately the order was processed and delivered. It was delivered in less than the expected wait time, and the sandwiches were wrapped and packaged very nicely. It's very obvious that this place loves good sandwiches.", "actual label": 1, "predict label": 1}
{"text": "I ordered a meal online for delivery and the food didn't arrive until 2 hours later (I live 4 minutes down the road). When the food Did come, it was cold. The only good thing was the energy beet juice I ordered. Pretty good stuff.", "actual label": 1, "predict label": 1}
{"text": "I have been here 3 times and have had a great experience every time. The service is friendly, bagels are delicious, and they are dog friendly which I love. They have home made dog bagels for your pets and water bowls as well.", "actual label": 1, "predict label": 0}
{"text": "Went there with some coworkers unplanned and based solely on Yelp recommendations. Everything was great! The staff was helpful and accommodating. The owner was very friendly and hands on. The hookah was very nice, Turkish coffee was fantastic and we tried uma Ali for the first time ( I don't know how to spell it, but that was how it sounded to me)... great! There is no alcohol there so if you cannot live without it go to a bar, but you'll be missing out. If instead you like great, friendly service in a warm inviting environment then this is where you belong.", "actual label": 1, "predict label": 0}
{"text": "Love Drip. I've been coming here for a few years now, and Gina and Vene always make my daughter and I feel right at home. And where else can you be guaranteed to see the mayor of phoenix sipping a cuppa joe.\n I love the food, especially the NY egg sandwich, and the homemade goodies that are usually on display. And the coffee is excellent, always nice and strong. However, they do make everything to order, so allow some time during busy hours (lunch, etc).\n They have free wi fi, and well placed outlets, most of them are quad boxes, so you will have place to plug in.\n And I have yet to hear a bad song, so overall, I would recommend it to anyone.", "actual label": 1, "predict label": 1}
{"text": "I have been coming here for a few years now and the service has steadily gotten worst. One server, who has been there as long as I've been going, Jesse i think his name is, hit on me and my friend, asking if we wanted to hang out later, even asked for our phone number.... I go here to eat, not to get hit on and made to feel like I need to leave because of some thirsty boy. Last time I was there, the girl who served me was very nice but never came to check how the food was and she never refilled my drink. I love the food here but if this type of service continues I will definitely be looking for another place of business to support.", "actual label": 1, "predict label": 1}
{"text": "5 stars for the food- i truly love the food here, everything is delicious and the margaritas are too good to not get \n5 stars for the service- any and every server I have had has exceeded my expectations! wonderful people!\nThere is one bartender there, I cant remember his name, he is maybe in his 30's, definitely heavier set guy, mexican and i think he wears glasses; I don't enjoy being served by him, I've overheard some sexually inappropriate comments coming from him concerning other paying customers in the restaurant. I find this highly offense and unprofessional, it makes me extremely uncomfortable and I also wonder what comments he has made about my body sexually.\nAll of the hostesses there are nice, friendly and full of smiles, except one, I dont know her name either. She is mexican, and last time I was in there she was handing out food, which was new, considering she is the girl who never smiles and makes it seem like it's a painful task to seat me. She always glares at me, never smiles, sighs when I let her know how many people are in my party and lazily walks us to our table. However, every other hostess I have ever come across here is all smiles, courteous and just as friendly as the servers.\n\nA couple bad apples can surely affect business, I know I avoid going to this establishment on certain days due to those specific employees. I have even mentioned something to the General Manager who simply replied, \"That is just who they are.\", with a smile on her face, like it wasn't a big deal and walked away. I was highly shocked, but with her attitude and lack of concern for the company, explains why those couple people act the way they do.", "actual label": 1, "predict label": 0}
{"text": "I love coming here with my friends! It always seems to be busy but I typically do not wait at all. All of the servers I have had were very nice, as well as the bartenders. The drinks can sometimes be a little strong, which is a shock at first but I always appreciate it. The food is always exactly how I ordered it and have never had a problem with it, my favorite is the big mouth bites! so good!!!", "actual label": 1, "predict label": 1}
{"text": "Love going here! My last two visits were decent. The server honestly, was rude, I do not remember her name; but seriously, every other time I have been here EVERYONE is so nice. Also, the potatoes seem to be slightly undercooked, again this is a more recent thing happening here, I am guessing there is a newer cook. The biscuits and gravy, Cajun omelet and the coffee are to die for!! Definitely somewhere you should try at least once, anyone I have every taken here has become a huge fan and always comes back", "actual label": 1, "predict label": 0}
{"text": "Nando's has some really good dishes and an atmosphere that is not typical of East Mesa........it's actually fun.  The number one item on the menu is the Pollo Rico.  I won't describe it, just order it.  It's delicious.  Gets a little crowded at the bar early with the old Las Sendas people that, for some strange reason, think they are the true upper crust of America, but push them out of the way and find a seat at the bar, where you will get good service.", "actual label": 1, "predict label": 1}
{"text": "I think I have eaten here a dozen or so times.  You think you can't get good seafood in Arizona, you're wrong.  This restaurant is amazing!  Their seafood is always fresh and tasty, the bread you get before your dinner is spectacular, the service is some of the best I've ever had, I can't say enough good things about this place.  Yes, it's expensive, but you get what you pay for.  If you don't normally go to nice dinners but have a special occasion, try the Salt Cellar.  Like I said, I have been there about a dozen times and I have never had a bad experience.", "actual label": 1, "predict label": 0}
{"text": "Lou's has great service and great food.  Their drinks are strong, but a little pricey for a neighborhood bar location.  Overall, a good place to grab dinner and have a drink.", "actual label": 1, "predict label": 0}
{"text": "Definitely the best bagel in the valley.  They have great lunch sandwiches as well.  They bake their bagels fresh all day long and have a ton of awesome flavored cream cheeses that are all made there too.  This place is a must if you want a great bagel!", "actual label": 1, "predict label": 1}
{"text": "This place is ok.  Definitely overrated.  The food was decent but nothing memorable, the service was good.  Cool atmosphere and some pretty good drinks too.  You will pay for your average food too.  For my wife, my friend and myself (with at least a few drinks each) our bill was climbing over $200.  Normally I wouldn't complain about this, but I would expect way more flavor for my money.", "actual label": 1, "predict label": 1}
{"text": "Let's just say this, if you are white trash, you will love this place.  You truly will fit in perfectly, since that is all that frequents this fine establishment.  Their food is not fit for humans, their service is very sub par, their clientelle is, as I've already stated, rather Apache Junction-like and the atmosphere is just depressing.  So come on down and make sure to wear your finest Metal Mullisha T-shirt and bring multiple packs of cigarettes to enjoy on their smoke filled patio, with the rest of the toothless patrons.", "actual label": 1, "predict label": 1}
{"text": "It's painful to say this, but I would prefer Pizza Hut over this awful pizza!", "actual label": 1, "predict label": 0}
{"text": "I love this restaurant.  If you are looking for good Italian food in the East Valley, you must travel to Baci.  Their pasta portions are huge and delicious, the bread they serve before the meal is great as well.  I must reccomend the cannolis, as they are to die for.  I'm not sure why people have said it is expensive, because it's really not.  Maybe they thought they were at Olive Garden and were expecting unlimited salad and pasta, who knows.  But hands down, the best Italian food in the East Valley.", "actual label": 1, "predict label": 0}
{"text": "I love Nando's!  Pollo Rico is amazing, as well as the enchiladas ongo and enchiladas del mar.  Great drinks and local craft beer on draft.  Try it.", "actual label": 1, "predict label": 1}
{"text": "The Golden Gate sandwich.  What more can I say?  I have dreams about it.......good ones.  Pastrami, bacon, swiss cheese and 1000 island dressing on a tasty sub roll and then baked.  This is my favorite sandwich in the valley.  Pair it with the homemade chips and bbq sauce and you are sure to be happy.\n\nThe place is really nice too.  Great selection of wine!", "actual label": 1, "predict label": 0}
{"text": "I have been here four or five times and each time it gets a little worse.  Not the worst cafe I have been to, just nothing special.  Their sandwiches are small and the bread is not good.  The cookies are about the only thing worth going back for.", "actual label": 1, "predict label": 1}
{"text": "Good sandwhich, great customer service. Here on vacation & i like off the beaten path places. Owner took our order with a smile & entertained our kids as well, super nice people. I had a pastrami & wife had a 62 (turkey, bacon with sprouts & avacado on a roll). Both very pleases with the food & very happy with service & owners. Busy place for being small so i knew i chose right. They do breakfast as well i guess", "actual label": 1, "predict label": 1}
{"text": "I was very pleased with the service and quality off the food and sushi! Will definitely be going back!", "actual label": 1, "predict label": 0}
{"text": "Otakumen/pat and Waldo's was almost deserted at 12:32 on a Wednesday, a warning sign I ignored to my regret. Ordered gyoza to go.  Priced low $5.  Box contains 5 tiny remarkably greasy gyoza.  Ate one and just can't face rest.  Much much too greasy.", "actual label": 1, "predict label": 1}
{"text": "the burger was good, not great but oh the service, i think they forgot all about us.   If you are looking to eat in less than an hour forget it!", "actual label": 1, "predict label": 0}
{"text": "i grew up thinking a crepe was golden brown in color, this one was purple or grey,  i'm not quite sure.  The chicken with swiss cheese was just alright, i certainly wouldn't rush back.  It is a very cute place, all the appointments were great, maybe they need to practice the cooking.", "actual label": 1, "predict label": 0}
{"text": "just got home from a great meal.  our server was very good and our tea and water glasses were never empty..  the lasagna was a true roman style, hard boiled egg and all.   it was only half full, but in the summer that is saying a lot.  can't wait to go back.", "actual label": 1, "predict label": 1}
{"text": "I absolutely love this place. My husband has been coming here practically since it opened and it is the freshest, tastiest, fast Mexican food out there. The ambience is casual but the customer service is exceptional as the staff always asks me to have a seat and brings menus as if it were a sit-down restaraunt. Fajitas are out of this world but I find I can't stop myself from ordering the nachos the past several times I have been. Their red and green salsa is delicious (very important) and they even have an actually spicy hot sauce instead of a wimpy excuse for hot sauce that most places have. The owner works hard to keep this place with a friendly, mom and pop vibe that I think keeps patrons like us coming back again and again.", "actual label": 1, "predict label": 1}
{"text": "Normally my fiancé and I love this place but last night our experience was so terrible that I doubt we will return any time soon! First off I felt like we had gone back in time to a high school dance! All of the waitresses were paying more time chatting about the boy working in the kitchen then checking on their guests! Second we ordered the homemade chips and salsa! Let me tell you the chips were definitely from a bag or they were old! Their was nothing homemade about them! And last but not least we normally visit this place for their delicious wings but they were far from delicious this time! The wings were not cooked all the way and were missing the sauces! After it took 20 minutes to get our waitresses attention,\nwe decided to get them to go and ended up cooking them ourselves at home! Poor experience will also share this with family who visits frequently!", "actual label": 1, "predict label": 0}
{"text": "Delicious food and great service. Nice quiet atmosphere for lunch or dinner!  I recommend the Bangkok curry!", "actual label": 1, "predict label": 1}
